sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.c
/*!
    \file    gd32a7xx_fmc.c
    \brief   FMC driver

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32a7xx_fmc.h"

/* FMC mask */
#define LOW_8BITS_MASK                  ((uint32_t)0x000000FFU)               /*!< the 0-7 bits mask of a word */
#define HIGH_8BITS_MASK                 ((uint32_t)0x0000FF00U)               /*!< the 8-15 bits mask of a word */
#define LOW_8BITS_MASK1                 ((uint32_t)0x00FF0000U)               /*!< the 16-23 bits mask of a word */
#define HIGH_8BITS_MASK1                ((uint32_t)0xFF000000U)               /*!< the 24-31 bits mask of a word */
#define LOW_16BITS_MASK                 ((uint32_t)0x0000FFFFU)               /*!< the 0-15 bits mask of a word */
#define HIGH_16BITS_MASK                ((uint32_t)0xFFFF0000U)               /*!< the 16-31 bits mask of a word */
#define ECC_FLAG_CLEAR_MASK             ((uint32_t)0xF0100000U)               /*!< the ecc flag clear bit mask*/

/* FMC register bit offset */
#define CTL_CBCMDLEN_OFFSET             ((uint32_t)0x0000001DU)               /*!< CBCMDLEN offset in FMC_CTLx register */
#define OBSTAT_PLEVEL_OFFSET            ((uint32_t)0x00000001U)               /*!< PLEVEL offset in FMC_OBSTAT register */
#define OBSTAT_USER_OFFSET              ((uint32_t)0x00000008U)               /*!< USER offset in FMC_OBSTAT register */
#define OBSTAT_DATA_OFFSET              ((uint32_t)0x00000010U)               /*!< DATA offset in FMC_OBSTAT register */

#define HSMOBSTAT_SPC_OFFSET            ((uint32_t)0x00000018U)               /*!< SPC offset in FMC_HSMOBSTAT register */

/* return the FMC ctl0 state */
static fmc_state_enum fmc_ctl0_state_get(void);
/* return the FMC ctl1 state */
static fmc_state_enum fmc_ctl1_state_get(void);
/* check whether FMC ctl0 is ready or not */
static fmc_state_enum fmc_ctl0_ready_wait(uint32_t timeout);
/* check whether FMC ctl1 is ready or not */
static fmc_state_enum fmc_ctl1_ready_wait(uint32_t timeout);

/*!
    \brief      unlock the control register 0/1 operation (API_ID(0x0001U))
                it is better to used in pairs with fmc_lock
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_unlock(void)
{
    if((0U != (FMC_CTL0 & FMC_CTL0_LK))) {
        /* write the FMC control register 0 key */
        FMC_KEY0 = UNLOCK_KEY0(0U);
        FMC_KEY0 = UNLOCK_KEY1(0U);
    }

    if((0U != (FMC_CTL1 & FMC_CTL1_LK))) {
        /* write the FMC control register 1 key */
        FMC_KEY1 = UNLOCK_KEY0(1U);
        FMC_KEY1 = UNLOCK_KEY1(1U);
    }
}

/*!
    \brief      unlock the control register 0 operation (API_ID(0x0002U))
                it is better to used in pairs with fmc_ctl0_lock
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_ctl0_unlock(void)
{
    if((0U != (FMC_CTL0 & FMC_CTL0_LK))) {
        /* write the FMC control register 0 key */
        FMC_KEY0 = UNLOCK_KEY0(0U);
        FMC_KEY0 = UNLOCK_KEY1(0U);
    }
}

/*!
    \brief      unlock the control register 1 operation (API_ID(0x0003U))
                it is better to used in pairs with fmc_ctl1_lock
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_ctl1_unlock(void)
{
    if((0U != (FMC_CTL1 & FMC_CTL1_LK))) {
        /* write the FMC control register 1 key */
        FMC_KEY1 = UNLOCK_KEY0(1U);
        FMC_KEY1 = UNLOCK_KEY1(1U);
    }
}

/*!
    \brief      lock the control register 0/1 operation (API_ID(0x0004U))
                it is better to used in pairs with fmc_unlock after an operation
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_lock(void)
{
    /* set the LK bit in FMC_CTL0 register */
    FMC_CTL0 |= FMC_CTL0_LK;
    /* set the LK bit in FMC_CTL1 register */
    FMC_CTL1 |= FMC_CTL1_LK;
}

/*!
    \brief      lock the control register 0 operation (API_ID(0x0005U))
                it is better to used in pairs with fmc_ctl0_unlock after an operation
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_ctl0_lock(void)
{
    /* set the LK bit in FMC_CTL0 register */
    FMC_CTL0 |= FMC_CTL0_LK;
}

/*!
    \brief      lock the control register 1 operation (API_ID(0x0006U))
                it is better to used in pairs with fmc_ctl1_unlock after an operation
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_ctl1_lock(void)
{
    /* set the LK bit in FMC_CTL1 register */
    FMC_CTL1 |= FMC_CTL1_LK;
}

/*!
    \brief      set the wait state counter value (API_ID(0x0007U))
    \param[in]  wscnt: wait state counter value
                only one parameter can be selected which is shown as below:
      \arg        WS_WSCNT_0: 0 wait state added
      \arg        WS_WSCNT_1: 1 wait state added
      \arg        WS_WSCNT_2: 2 wait state added
      \arg        WS_WSCNT_3: 3 wait state added
      \arg        WS_WSCNT_4: 4 wait state added
      \arg        WS_WSCNT_5: 5 wait state added
    \param[out] none
    \retval     none
*/
void fmc_wscnt_set(uint8_t wscnt)
{
    uint32_t reg;

