sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_WS_WSCNT(wscnt)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0007U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = FMC_WS;        /* set the wait state counter value */
        reg &= ~FMC_WS_WSCNT;
        FMC_WS = (reg | wscnt);
    }
}

/*!
    \brief      enable buffer x (API_ID(0x0008U))
    \param[in]  index: buffer number index
                only one parameter can be selected which is shown as below:
      \arg        FMC_BUFF_0: buffer 0
      \arg        FMC_BUFF_1: buffer 1 (Only applicable to GD32A72XX / GD32A74XX)
      \arg        FMC_BUFF_2: buffer 2
      \arg        FMC_BUFF_3: buffer 3
    \param[out] none
    \retval     none
*/
void fmc_buffer_enable(fmc_buff_enum index)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_BUFFER_INDEX(index)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0008U), ERR_PARAM_INVALID);
    } else
#endif
    {
        FMC_BUFECCCS(index) |= FMC_BUFECCCS_BUFEN;
    }
}

/*!
    \brief      disable buffer x (API_ID(0x0009U))
    \param[in]  index: buffer number index
                only one parameter can be selected which is shown as below:
      \arg        FMC_BUFF_0: buffer 0
      \arg        FMC_BUFF_1: buffer 1 (Only applicable to GD32A72XX / GD32A74XX)
      \arg        FMC_BUFF_2: buffer 2
      \arg        FMC_BUFF_3: buffer 3
    \param[out] none
    \retval     none
*/
void fmc_buffer_disable(fmc_buff_enum index)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_BUFFER_INDEX(index)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    } else
#endif
    {
        FMC_BUFECCCS(index) &= ~FMC_BUFECCCS_BUFEN;
    }
}

/*!
    \brief      enable buffer x read code buffers (API_ID(0x000AU))
    \param[in]  index: buffer number index
                only one parameter can be selected which is shown as below:
      \arg        FMC_BUFF_0: buffer 0
      \arg        FMC_BUFF_1: buffer 1 (Only applicable to GD32A72XX / GD32A74XX)
      \arg        FMC_BUFF_2: buffer 2
      \arg        FMC_BUFF_3: buffer 3
    \param[out] none
    \retval     none
*/
void fmc_code_current_buffer_enable(fmc_buff_enum index)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_BUFFER_INDEX(index)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else
#endif
    {
        FMC_BUFECCCS(index) |= FMC_BUFECCCS_CBUFEN;
    }
}

/*!
    \brief      disable buffer x read code buffers (API_ID(0x000BU))
    \param[in]  index: buffer number index
                only one parameter can be selected which is shown as below:
      \arg        FMC_BUFF_0: buffer 0
      \arg        FMC_BUFF_1: buffer 1 (Only applicable to GD32A72XX / GD32A74XX)
      \arg        FMC_BUFF_2: buffer 2
      \arg        FMC_BUFF_3: buffer 3
    \param[out] none
    \retval     none
*/
void fmc_code_current_buffer_disable(fmc_buff_enum index)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_BUFFER_INDEX(index)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else
#endif
    {
        FMC_BUFECCCS(index) &= ~FMC_BUFECCCS_CBUFEN;
    }
}

/*!
    \brief      enable buffer x read data buffers (API_ID(0x000CU))
    \param[in]  index: buffer number index
                only one parameter can be selected which is shown as below:
      \arg        FMC_BUFF_0: buffer 0
      \arg        FMC_BUFF_1: buffer 1 (Only applicable to GD32A72XX / GD32A74XX)
      \arg        FMC_BUFF_2: buffer 2
      \arg        FMC_BUFF_3: buffer 3
    \param[out] none
    \retval     none
*/
void fmc_data_current_buffer_enable(fmc_buff_enum index)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_BUFFER_INDEX(index)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x000CU), ERR_PARAM_INVALID);
    } else
#endif
    {
        FMC_BUFECCCS(index) |= FMC_BUFECCCS_DBUFEN;
    }
}

/*!
    \brief      disable buffer x read data buffers (API_ID(0x000DU))
    \param[in]  index: buffer number index
                only one parameter can be selected which is shown as below:
      \arg        FMC_BUFF_0: buffer 0
      \arg        FMC_BUFF_1: buffer 1 (Only applicable to GD32A72XX / GD32A74XX)
      \arg        FMC_BUFF_2: buffer 2
      \arg        FMC_BUFF_3: buffer 3
    \param[out] none
    \retval     none
*/
void fmc_data_current_buffer_disable(fmc_buff_enum index)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_BUFFER_INDEX(index)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x000DU), ERR_PARAM_INVALID);
    } else
#endif
    {
        FMC_BUFECCCS(index) &= ~FMC_BUFECCCS_DBUFEN;
    }
}

/*!
    \brief      enable buffer x code prefetch (API_ID(0x000EU))
    \param[in]  index: buffer number index
                only one parameter can be selected which is shown as below:
      \arg        FMC_BUFF_0: buffer 0
      \arg        FMC_BUFF_1: buffer 1 (Only applicable to GD32A72XX / GD32A74XX)
      \arg        FMC_BUFF_2: buffer 2
      \arg        FMC_BUFF_3: buffer 3
    \param[out] none
    \retval     none
*/
void fmc_code_prefetch_buffer_enable(fmc_buff_enum index)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_BUFFER_INDEX(index)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x000EU), ERR_PARAM_INVALID);
    } else
#endif
    {
        FMC_BUFECCCS(index) |= FMC_BUFECCCS_CPFEN;
    }
}

/*!
    \brief      disable buffer x code prefetch (API_ID(0x000FU))
    \param[in]  index: buffer number index
                only one parameter can be selected which is shown as below:
      \arg        FMC_BUFF_0: buffer 0
      \arg        FMC_BUFF_1: buffer 1 (Only applicable to GD32A72XX / GD32A74XX)
      \arg        FMC_BUFF_2: buffer 2
      \arg        FMC_BUFF_3: buffer 3
    \param[out] none
    \retval     none
*/
void fmc_code_prefetch_buffer_disable(fmc_buff_enum index)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_BUFFER_INDEX(index)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x000FU), ERR_PARAM_INVALID);
    } else
#endif
    {
        FMC_BUFECCCS(index) &= ~FMC_BUFECCCS_CPFEN;
    }
}

/*!
    \brief      enable buffer x data prefetch (API_ID(0x0010U))
    \param[in]  index: buffer number index
                only one parameter can be selected which is shown as below:
      \arg        FMC_BUFF_0: buffer 0
      \arg        FMC_BUFF_1: buffer 1 (Only applicable to GD32A72XX / GD32A74XX)
      \arg        FMC_BUFF_2: buffer 2
      \arg        FMC_BUFF_3: buffer 3
    \param[out] none
    \retval     none
*/
void fmc_data_prefetch_buffer_enable(fmc_buff_enum index)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_BUFFER_INDEX(index)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0010U), ERR_PARAM_INVALID);
    } else
#endif
    {
        FMC_BUFECCCS(index) |= FMC_BUFECCCS_DPFEN;
    }
}

/*!
    \brief      disable buffer x data prefetch (API_ID(0x0011U))
    \param[in]  index: buffer number index
                only one parameter can be selected which is shown as below:
      \arg        FMC_BUFF_0: buffer 0
      \arg        FMC_BUFF_1: buffer 1 (Only applicable to GD32A72XX / GD32A74XX)
      \arg        FMC_BUFF_2: buffer 2
      \arg        FMC_BUFF_3: buffer 3
    \param[out] none
    \retval     none
*/
void fmc_data_prefetch_buffer_disable(fmc_buff_enum index)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_BUFFER_INDEX(index)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0011U), ERR_PARAM_INVALID);
    } else
#endif
    {
        FMC_BUFECCCS(index) &= ~FMC_BUFECCCS_DPFEN;
    }
}

/*!
    \brief      check whether area in bank0/bank1/data flash page is blank or not by check blank command (API_ID(0x0012U))
    \param[in]  address: start address to check. the value is in the range of bank0 / bank1 / data flash
    \param[in]  length: the read length is 2^(length + 1) double words, the flash area to be checked must be in one page and should not exceed 2KB boundary
                only one parameter can be selected which is shown as below:
      \arg        FMC_CBCMDLEN_2_DW: check blank command read length is 2 double words (16 bytes)
      \arg        FMC_CBCMDLEN_4_DW: check blank command read length is 4 double words (32 bytes)
      \arg        FMC_CBCMDLEN_8_DW: check blank command read length is 8 double words (64 bytes)
      \arg        FMC_CBCMDLEN_16_DW: check blank command read length is 16 double words (128 bytes)
      \arg        FMC_CBCMDLEN_32_DW: check blank command read length is 32 double words (256 bytes)
      \arg        FMC_CBCMDLEN_64_DW: check blank command read length is 64 double words (512 bytes)
      \arg        FMC_CBCMDLEN_128_DW: check blank command read length is 128 double words (1024 bytes)
      \arg        FMC_CBCMDLEN_256_DW: check blank command read length is 256 double words (2048 bytes)
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum fmc_blank_check(uint32_t address, uint8_t length)
{
    fmc_state_enum fmc_state = FMC_READY;

