sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_VALID_INTERFACE0_ADDRESS(address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0012U), ERR_PARAM_INVALID);
    } else if(NOT_FMC_VALID_BLANK_ADDRESS_CONFIG(address, length)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0012U), ERR_PARAM_INVALID);
    } else
#endif
    {
        fmc_ctl0_unlock();
        /* start check blank command */
        FMC_ADDR0 = address;
        FMC_CTL0 &= ~FMC_CTL0_CBCMDLEN;
        FMC_CTL0 |= (uint32_t)length << CTL_CBCMDLEN_OFFSET;
        FMC_CTL0 |= FMC_CTL0_CBCMD;
        FMC_CTL0 |= FMC_CTL0_START;
        /* wait for the FMC ready */
        fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
        fmc_ctl0_unlock();
        /* reset the CBCMD bit */
        FMC_CTL0 &= ~FMC_CTL0_CBCMD;
        /* lock CTL0 */
        fmc_ctl0_lock();
    }
    return fmc_state;
}

/*!
    \brief      get base address of bank0 (API_ID(0x0013U))
    \param[in]  none
    \param[out] none
    \retval     base address of bank0, 0x08000000 ~ 0x083FFFFF
*/
uint32_t fmc_bank0_base_address_get(void)
{
    uint32_t base_addr;

    if(0U == (FMC_HSMOBSTAT & FMC_HSMOBSTAT_SWAP)) {
        base_addr = BANK0_BASE_ADDRESS + fmc_bank_size_get();
    } else {
        base_addr = BANK0_BASE_ADDRESS;
    }

    return base_addr;
}

/*!
    \brief      get base address of bank1 (API_ID(0x0014U))
    \param[in]  none
    \param[out] none
    \retval     base address of bank, 0x08000000 ~ 0x083FFFFF
*/
uint32_t fmc_bank1_base_address_get(void)
{
    uint32_t base_addr;

    if(0U == (FMC_HSMOBSTAT & FMC_HSMOBSTAT_SWAP)) {
        base_addr = BANK0_BASE_ADDRESS;
    } else {
        base_addr = BANK0_BASE_ADDRESS + fmc_bank_size_get();
    }

    return base_addr;
}

/*!
    \brief      erase bank0/bank1/data flash page (API_ID(0x0015U))
    \param[in]  page_address: target page start address, the value is in the range of bank0 / bank1 / data flash
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum fmc_page_erase(uint32_t page_address)
{
    fmc_state_enum fmc_state = FMC_READY;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_VALID_INTERFACE0_ADDRESS(page_address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0015U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* wait for the FMC ready */
        fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);

        if(FMC_READY == fmc_state) {
            /* unlock CTL0 */
            fmc_ctl0_unlock();
            /* start page erase */
            FMC_ADDR0 = page_address;
            FMC_CTL0 |= FMC_CTL0_PER;
            FMC_CTL0 |= FMC_CTL0_START;
            /* wait for the FMC ready */
            fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
            fmc_ctl0_unlock();
            /* reset the PER bit */
            FMC_CTL0 &= ~FMC_CTL0_PER;
            /* lock CTL0 */
            fmc_ctl0_lock();
        }
    }
    /* return the FMC state  */
    return fmc_state;
}

/*!
    \brief      mass erase bank0/bank1/data flash (API_ID(0x0016U))
    \param[in]  area: mass erase area
                only one parameter can be selected which is shown as below:
      \arg        BANK0_AREA: main flash bank0 area
      \arg        BANK1_AREA: main flash bank1 area
      \arg        DATA_FLASH_AREA: data flash area
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum fmc_mass_erase(fmc_area_enum area)
{
    uint32_t address = 0U;
    fmc_state_enum  fmc_state = FMC_READY;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_HOST_AREA(area)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0016U), ERR_PARAM_INVALID);
    } else
#endif
    {
        switch(area) {
        case BANK0_AREA:
            /* bank0 start address */
            address = fmc_bank0_base_address_get();
            break;
        case BANK1_AREA:
            /* bank1 start address */
            address = fmc_bank1_base_address_get();
            break;
        case DATA_FLASH_AREA:
            /* data flash start address */
            address = HOST_DATA_BASE_ADDRESS;
            break;
        default:
            break;
        }

        /* wait for the FMC ready */
        fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);

        if(FMC_READY == fmc_state) {
            /* unlock CTL0 */
            fmc_ctl0_unlock();
            /* write block address */
            FMC_ADDR0 = address;
            /* start chip erase */
            FMC_CTL0 |= FMC_CTL0_MER;
            FMC_CTL0 |= FMC_CTL0_START;
            /* wait for the FMC ready */
            fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
            fmc_ctl0_unlock();
            /* reset the MER bit */
            FMC_CTL0 &= ~FMC_CTL0_MER;
            /* lock CTL0 */
            fmc_ctl0_lock();
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      program a double word at the corresponding address in bank0 / bank1 / data flash (API_ID(0x0017U))
    \param[in]  address: address to program, the value is in the range of bank0 / bank1 / data flash
    \param[in]  data: double word to program
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum fmc_doubleword_program(uint32_t address, uint64_t data)
{
    uint32_t data0, data1;
    fmc_state_enum  fmc_state = FMC_READY;

