sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_VALID_INTERFACE0_ADDRESS(address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0017U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* wait for the FMC ready */
        fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
        data0 = (uint32_t)(data & 0xFFFFFFFFU);
        data1 = (uint32_t)((data >> 32U) & 0xFFFFFFFFU);

        if(FMC_READY == fmc_state) {
            /* unlock CTL0 */
            fmc_ctl0_unlock();
            /* set the PG bit to start program */
            FMC_CTL0 |= FMC_CTL0_PG;
            __DSB();
            __ISB();
            /* write the data to WDATAL0 and WDATAH0 */
            FMC_WDATL0 = data0;
            FMC_WDATH0 = data1;
            /* write the logic address */
            FMC_ADDR0 = address;
            /* set START bit to launch double program operation to flash */
            FMC_CTL0 |= FMC_CTL0_START;
            __DSB();
            __ISB();
            /* wait for the FMC ready */
            fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
            fmc_ctl0_unlock();
            /* reset the PG bit */
            FMC_CTL0 &= ~FMC_CTL0_PG;
            /* lock CTL0 */
            fmc_ctl0_lock();
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      fast program one row data (64 double-word) starting at the corresponding address in bank0 / bank1 / data flash (API_ID(0x0018U))
    \param[in]  address: address to program, the value is in the range of bank0 / bank1 / data flash
    \param[in]  data: data buffer to program
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum fmc_fast_program(uint32_t address, uint64_t data[])
{
    uint8_t index;
    fmc_state_enum  fmc_state = FMC_READY;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_VALID_INTERFACE0_ADDRESS(address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0018U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* check the row (64 double-word) in flash to confirm all data in flash is all 0xFF */
        fmc_state = fmc_blank_check(address, CBCMDLEN_OF_ONE_ROW);

        if(FMC_CBCMDERR == fmc_state) {
            /* flash is not erased */
            fmc_state =  FMC_CBCMDERR;
        } else {
            /* wait for the FMC ready */
            fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);

            if(FMC_READY == fmc_state) {
                fmc_ctl0_unlock();
                /* set the FSTPG bit to start program */
                FMC_CTL0 |= FMC_CTL0_FSTPG;

                /* program the row data */
                for(index = 0U; index < DOUBLEWORD_CNT_IN_ROW; index++) {
                    /* write the data to WDATAL0 and WDATAH0 */
                    FMC_WDATL0 = (uint32_t)(data[index] & 0x00000000FFFFFFFFU);
                    FMC_WDATH0 = (uint32_t)(data[index] >> 32U);
                }

                FMC_ADDR0 = address;
                /* set START bit to launch fast program operation to flash */
                FMC_CTL0 |= FMC_CTL0_START;
                /* wait for the FMC ready */
                fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
                fmc_ctl0_unlock();
                /* reset the FSTPG bit */
                FMC_CTL0 &= ~FMC_CTL0_FSTPG;
                /* lock CTL0 */
                fmc_ctl0_lock();
            }
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      program a double word at the corresponding address in OTP (API_ID(0x0019U))
    \param[in]  address: address to program
    \param[in]  data: double word to write
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum fmc_otp_doubleword_program(uint32_t address, uint64_t data)
{
    uint32_t data0, data1;
    fmc_state_enum  fmc_state = FMC_READY;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_VALID_INTERFACE0_OTP_ADDRESS(address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0019U), ERR_PARAM_INVALID);
    } else
#endif
    {
        fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
        data0 = (uint32_t)(data & 0xFFFFFFFFU);
        data1 = (uint32_t)((data >> 32U) & 0xFFFFFFFFU);

        if(FMC_READY == fmc_state) {
            fmc_ctl0_unlock();
            /* set the PG bit to start program */
            FMC_CTL0 |= FMC_CTL0_PG;
            /* write the data to WDATAL0 and WDATAH0 */
            FMC_WDATL0 = data0;
            FMC_WDATH0 = data1;
            /* write the logic address */
            FMC_ADDR0 = address;
            /* set START bit to launch double program operation to flash */
            FMC_CTL0 |= FMC_CTL0_START;
            /* wait for the FMC ready */
            fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
            fmc_ctl0_unlock();
            /* reset the PG bit */
            FMC_CTL0 &= ~FMC_CTL0_PG;
            /* lock CTL0 */
            fmc_ctl0_lock();
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      bank0 / bank1 size get (API_ID(0x001AU))
    \param[in]  none
    \param[out] none
    \retval     bank0 / bank1 size get size, 0x00000000 ~ 0x00200000
*/
uint32_t fmc_bank_size_get(void)
{
    uint32_t bank_size;
    uint32_t size_index = (FMC_HSMWP & FMC_HSMWP_HOSTSIZE) >> 30U;

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    uint32_t _bank_size[4] = {512, 1024, 0, 2048};
#else
    uint32_t _bank_size[4] = {256, 512, 0, 1024};
#endif

    /* return HOST bank0 / bank1 size */
    if(0x03U == size_index) {
        bank_size = _bank_size[size_index] * 1024U - hsm_bank_size_get();
    } else {
        bank_size = _bank_size[size_index] * 1024U;
    }

    return bank_size;
}

/*!
    \brief      check whether area in HSM data flash page is blank or not by check blank command (API_ID(0x001BU))
    \param[in]  address: start address to check. the value is in the range of HSM data flash
    \param[in]  length: the read length is 2^(length + 1) double words, the flash area to be checked must be in one page and should not exceed 2KB boundary
                only one parameter can be selected which is shown as below:
      \arg        FMC_CBCMDLEN_2_DW: check blank command read length is 2 double words (16 bytes)
      \arg        FMC_CBCMDLEN_4_DW: check blank command read length is 4 double words (32 bytes)
      \arg        FMC_CBCMDLEN_8_DW: check blank command read length is 8 double words (64 bytes)
      \arg        FMC_CBCMDLEN_16_DW: check blank command read length is 16 double words (128 bytes)
      \arg        FMC_CBCMDLEN_32_DW: check blank command read length is 32 double words (256 bytes)
      \arg        FMC_CBCMDLEN_64_DW: check blank command read length is 64 double words (512 bytes)
      \arg        FMC_CBCMDLEN_128_DW: check blank command read length is 128 double words (1024 bytes)
      \arg        FMC_CBCMDLEN_256_DW: check blank command read length is 256 double words (2048 bytes)
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum fmc_hsm_data_blank_check(uint32_t address, uint8_t length)
{
    fmc_state_enum  fmc_state = FMC_READY;

