sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_VALID_INTERFACE1_DATA_FLASH_ADDRESS(address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x001BU), ERR_PARAM_INVALID);
    } else if(NOT_FMC_VALID_BLANK_ADDRESS_CONFIG(address, length)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x001BU), ERR_PARAM_INVALID);
    } else
#endif
    {
        fmc_ctl1_unlock();
        /* start check blank command */
        FMC_ADDR1 = address;
        FMC_CTL1 &= ~FMC_CTL1_CBCMDLEN;
        FMC_CTL1 |= (uint32_t)length << CTL_CBCMDLEN_OFFSET;
        FMC_CTL1 |= FMC_CTL1_CBCMD;
        FMC_CTL1 |= FMC_CTL1_START;
        /* wait for the FMC ready */
        fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
        fmc_ctl1_unlock();
        /* reset the CBCMD bit */
        FMC_CTL1 &= ~FMC_CTL1_CBCMD;
        /* lock CTL1 */
        fmc_ctl1_lock();
    }
    return fmc_state;
}

/*!
    \brief      get base address of HSM bank 0 (API_ID(0x001CU))
    \param[in]  none
    \param[out] none
    \retval     base address of HSM bank 0, 0x08440000 / 0x08480000
*/
uint32_t fmc_hsm_bank0_address_get(void)
{
    uint32_t base_addr;

    if(0U == (FMC_HSMOBSTAT & FMC_HSMOBSTAT_SWAP)) {
        base_addr = HSM_BANK1_ADDRESS;
    } else {
        base_addr = HSM_BANK0_ADDRESS;
    }

    return base_addr;
}

/*!
    \brief      get base address of HSM bank 1 (API_ID(0x001DU))
    \param[in]  none
    \param[out] none
    \retval     base address of HSM bank 1, 0x08440000 / 0x08480000
*/
uint32_t fmc_hsm_bank1_address_get(void)
{
    uint32_t base_addr;

    if(0U == (FMC_HSMOBSTAT & FMC_HSMOBSTAT_SWAP)) {
        base_addr = HSM_BANK0_ADDRESS;
    } else {
        base_addr = HSM_BANK1_ADDRESS;
    }

    return base_addr;
}

/*!
    \brief      erase HSM bank page (API_ID(0x001EU))
    \param[in]  page_address: target page start address, the value is in the range of HSM bank0 / bank1 memory
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum fmc_hsm_bank_page_erase(uint32_t page_address)
{
    fmc_state_enum fmc_state;

    fmc_state = fmc_page_erase(page_address);

    return fmc_state;
}

/*!
    \brief      program a double word at the corresponding address in HSM bank0 / bank1 flash (API_ID(0x001FU))
    \param[in]  address: address to program, the value is in the range of HSM bank0/1 flash
    \param[in]  data: double word to program
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum fmc_hsm_bank_doubleword_program(uint32_t address, uint64_t data)
{
    return fmc_doubleword_program(address, data);
}

/*!
    \brief      fast program one row data (64 double-word) starting at the corresponding address in HSM bank0 / bank1 flash (API_ID(0x0020U))
    \param[in]  address: address to program, the value is in the range of bank0 / bank1 / data flash
    \param[in]  data: data buffer to program
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum fmc_hsm_bank_fast_program(uint32_t address, uint64_t data[])
{
    return fmc_fast_program(address, data);
}

/*!
    \brief      HSM erase data flash page (API_ID(0x0021U))
    \param[in]  page_address: target page start address, the value is in the range of HSM data flash
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum fmc_hsm_data_page_erase(uint32_t page_address)
{
    fmc_state_enum fmc_state = FMC_READY;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_VALID_INTERFACE1_DATA_FLASH_ADDRESS(page_address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0021U), ERR_PARAM_INVALID);
    } else
#endif
    {
        fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);

        if(FMC_READY == fmc_state) {
            /* unlock CTL1 */
            fmc_ctl1_unlock();
            /* start page erase */
            FMC_ADDR1 = page_address;
            FMC_CTL1 |= FMC_CTL1_PER;
            FMC_CTL1 |= FMC_CTL1_START;
            /* wait for the FMC ready */
            fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
            fmc_ctl1_unlock();
            /* reset the PER bit */
            FMC_CTL1 &= ~FMC_CTL1_PER;
            /* lock CTL1 */
            fmc_ctl1_lock();
        }
    }
    /* return the FMC state  */
    return fmc_state;
}

/*!
    \brief      program a double word at the corresponding address in HSM data flash (API_ID(0x0022U))
    \param[in]  address: address to program, the value is in the range of HSM data flash
    \param[in]  data: double word to program
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum fmc_hsm_data_doubleword_program(uint32_t address, uint64_t data)
{
    uint32_t data0, data1;
    fmc_state_enum fmc_state = FMC_READY;

