sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_VALID_INTERFACE1_DATA_FLASH_ADDRESS(address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0022U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* wait for the FMC ready */
        fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
        data0 = (uint32_t)(data & 0xFFFFFFFFU);
        data1 = (uint32_t)((data >> 32U) & 0xFFFFFFFFU);

        if(FMC_READY == fmc_state) {
            /* unlock CTL1 */
            fmc_ctl1_unlock();
            /* set the PG bit to start program */
            FMC_CTL1 |= FMC_CTL1_PG;
            /* write the data to WDATAL1 and WDATAH1 */
            FMC_WDATL1 = data0;
            FMC_WDATH1 = data1;
            /* write the logic address */
            FMC_ADDR1 = address;
            /* set START bit to launch double program operation to flash */
            FMC_CTL1 |= FMC_CTL1_START;
            /* wait for the FMC ready */
            fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
            fmc_ctl1_unlock();
            /* reset the PG bit */
            FMC_CTL1 &= ~FMC_CTL1_PG;
            /* lock CTL1 */
            fmc_ctl1_lock();
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      HSM fast program one row data (64 double-word) starting at the corresponding address (API_ID(0x0023U))
    \param[in]  address: address to program, the value is in the range of HSM data flash
    \param[in]  data: data buffer to program
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum fmc_hsm_data_fast_program(uint32_t address, uint64_t data[])
{
    uint8_t index;
    fmc_state_enum fmc_state = FMC_READY;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_VALID_INTERFACE1_DATA_FLASH_ADDRESS(address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0023U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* check the row (64 double-word) in flash to confirm all data in flash is all 0xFF */
        fmc_state = fmc_hsm_data_blank_check(address, CBCMDLEN_OF_ONE_ROW);

        if(FMC_CBCMDERR == fmc_state) {
            /* flash is not erased */
            return FMC_CBCMDERR;
        }

        /* wait for the FMC ready */
        fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);

        if(FMC_READY == fmc_state) {
            fmc_ctl1_unlock();
            /* set the FSTPG bit to start program */
            FMC_CTL1 |= FMC_CTL1_FSTPG;

            /* program the row data */
            for(index = 0U; index < DOUBLEWORD_CNT_IN_ROW; index++) {
                /* write the data to WDATAL1 and WDATAH1 */
                FMC_WDATL1 = (uint32_t)(data[index] & 0x00000000FFFFFFFFU);
                FMC_WDATH1 = (uint32_t)(data[index] >> 32U);
            }

            FMC_ADDR1 = address;
            /* set START bit to launch fast program operation to flash */
            FMC_CTL1 |= FMC_CTL1_START;
            /* wait for the FMC ready */
            fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
            fmc_ctl1_unlock();
            /* reset the FSTPG bit */
            FMC_CTL1 &= ~FMC_CTL1_FSTPG;
            /* lock CTL1 */
            fmc_ctl1_lock();
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      program a double word at the corresponding address in HSM OTP (API_ID(0x0024U))
    \param[in]  address: address to program
    \param[in]  data: double word to write
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum hsm_otp_doubleword_program(uint32_t address, uint64_t data)
{
    uint32_t data0, data1;
    fmc_state_enum  fmc_state = FMC_READY;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_VALID_INTERFACE1_OTP_ADDRESS(address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0024U), ERR_PARAM_INVALID);
    } else
#endif
    {
        fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
        data0 = (uint32_t)(data & 0xFFFFFFFFU);
        data1 = (uint32_t)((data >> 32U) & 0xFFFFFFFFU);

        if(FMC_READY == fmc_state) {
            fmc_ctl1_unlock();
            /* set the PG bit to start program */
            FMC_CTL1 |= FMC_CTL1_PG;
            /* write the data to WDATAL1 and WDATAH1 */
            FMC_WDATL1 = data0;
            FMC_WDATH1 = data1;
            /* write the logic address */
            FMC_ADDR1 = address;
            /* set START bit to launch double program operation to flash */
            FMC_CTL1 |= FMC_CTL1_START;
            /* wait for the FMC ready */
            fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
            fmc_ctl1_unlock();
            /* reset the PG bit */
            FMC_CTL1 &= ~FMC_CTL1_PG;
            /* lock CTL1 */
            fmc_ctl1_lock();
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      HSM system mark LC slot valid field (API_ID(0x0025U))
    \param[in]  address: address to program
                only one parameter can be selected which is shown as below:
      \arg        LC_SLOT0_BASE_ADDRESS: slot0 base address
      \arg        LC_SLOT1_BASE_ADDRESS: slot1 base address
      \arg        LC_SLOT2_BASE_ADDRESS: slot2 base address
      \arg        LC_SLOT3_BASE_ADDRESS: slot3 base address
      \arg        LC_SLOT4_BASE_ADDRESS: slot4 base address
      \arg        LC_IN_FIELD_RECOVER_MODE: IN_FIELD_RECOVER_MODE base address
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum hsm_lc_valid_mark(uint32_t address)
{
    fmc_state_enum fmc_state = FMC_READY;

