sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_LC_SLOT_ADDRESS(address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0025U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* program valid field to marked */
        fmc_state = hsm_otp_doubleword_program(address, (uint64_t)LC_MARKED);
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      HSM system mark LC slot invalid field (API_ID(0x0026U))
    \param[in]  address: address to program
                only one parameter can be selected which is shown as below:
      \arg        LC_SLOT0_BASE_ADDRESS: slot0 base address
      \arg        LC_SLOT1_BASE_ADDRESS: slot1 base address
      \arg        LC_SLOT2_BASE_ADDRESS: slot2 base address
      \arg        LC_SLOT3_BASE_ADDRESS: slot3 base address
      \arg        LC_SLOT4_BASE_ADDRESS: slot4 base address
      \arg        LC_IN_FIELD_RECOVER_MODE: IN_FIELD_RECOVER_MODE base address
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum hsm_lc_invalid_mark(uint32_t address)
{
    fmc_state_enum fmc_state = FMC_READY;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_LC_SLOT_ADDRESS(address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0026U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* if LC slot is other value, return FMC_PGERR */
        if(REG64(address + 8U) != LC_ERASED) {
            fmc_state =   FMC_PGERR;
        } else {
            /* program invalid field to marked */
            fmc_state = hsm_otp_doubleword_program(address + 8U, (uint64_t)LC_MARKED);
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      HOST dbg disable (API_ID(0x0027U))
    \param[in]  none
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum hsm_host_dbg_disable(void)
{
    /* return the FMC state */
    return hsm_otp_doubleword_program(HOST_DBG_DISABLE_ADDRESS, (uint64_t)0x5A0FA5F0);
}

/*!
    \brief      HSM dbg disable (API_ID(0x0028U))
    \param[in]  none
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum hsm_hsm_dbg_disable(void)
{
    /* return the FMC state */
    return hsm_otp_doubleword_program(HSM_DBG_DISABLE_ADDRESS, (uint64_t)0x5A0FA5F0);
}

/*!
    \brief      HOST / HSM debug password configuration in HSM OTP (API_ID(0x0029U))
    \param[in]  address: address to program
                only one parameter can be selected which is shown as below:
      \arg        HOST_DBG_PASSWORD_ADDRESS: HOST password base address
      \arg        HSM_DBG_PASSWORD_ADDRESS: HSM password base address
    \param[in]  data: data buffer to program. data buffer is two double-word
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum hsm_debug_password_config(uint32_t address, uint64_t data[])
{
    uint8_t index;
    fmc_state_enum fmc_state = FMC_READY;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_DBG_PASSWORD_ADDRESS(address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0029U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* program the two double-word data */
        for(index = 0U; index < 2U; index++) {
            /* program a double word */
            fmc_state = hsm_otp_doubleword_program(address, data[index]);
            address += 8U;
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      HSM cryp key configuration in HSM OTP (API_ID(0x002AU))
    \param[in]  address: address to program
                only one parameter can be selected which is shown as below:
      \arg        CRYP_KEY1_BASE_ADDRESS: cryp key1 base address
      \arg        CRYP_KEY2_BASE_ADDRESS: cryp key2 base address
    \param[in]  data: data buffer to program. data buffer is four double-word
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum hsm_cryp_key_config(uint32_t address, uint64_t data[])
{
    uint8_t index;
    fmc_state_enum fmc_state = FMC_READY;

