sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_CRYP_KEY_ADDRESS(address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x002AU), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* program the four double-word data */
        for(index = 0U; index < 4U; index++) {
            /* program a double word */
            fmc_state = hsm_otp_doubleword_program(address, data[index]);
            address += 8U;
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      HSM SPC key configuration in HSM OTP (API_ID(0x002BU))
    \param[in]  data: data buffer to program. data buffer is two double-word
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum hsm_spc_key_config(uint64_t data[])
{
    uint8_t index;
    uint32_t address = SPC_KEY_BASE_ADDRESS;
    fmc_state_enum  fmc_state = FMC_READY;

    /* program the two double-word data */
    for(index = 0U; index < 2U; index++) {
        /* program a double word */
        fmc_state = hsm_otp_doubleword_program(address, data[index]);
        address += 8U;
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      unlock SPC protection with SPC key (API_ID(0x002CU))
    \param[in]  key: Password of unlock SPC
    \param[out] none
    \retval     none
*/
void spc_unlock(uint32_t key[])
{
    uint8_t index;

    /* program the two double-word data */
    for(index = 0U; index < 4U; index++) {
        /* program a double word */
        FMC_SPCKEY = key[index];
    }
}

/*!
    \brief      configure HSM bank0 / bank1 size (API_ID(0x002DU))
    \param[in]  hsm_size: HSM bank0 / bank1 size
                only one parameter can be selected which is shown as below:
      \arg        HSM_BANK_SIZE_NONE: HSM bank size is none
      \arg        HSM_BANK_SIZE_16K: HSM bank size is 16K
      \arg        HSM_BANK_SIZE_32K: HSM bank size is 32K
      \arg        HSM_BANK_SIZE_48K: HSM bank size is 48K
      \arg        HSM_BANK_SIZE_64K: HSM bank size is 64K
      \arg        HSM_BANK_SIZE_80K: HSM bank size is 80K
      \arg        HSM_BANK_SIZE_96K: HSM bank size is 96K
      \arg        HSM_BANK_SIZE_112K: HSM bank size is 112K
      \arg        HSM_BANK_SIZE_128K: HSM bank size is 128K
      \arg        HSM_BANK_SIZE_144K: HSM bank size is 144K
      \arg        HSM_BANK_SIZE_160K: HSM bank size is 160K
      \arg        HSM_BANK_SIZE_176K: HSM bank size is 176K
      \arg        HSM_BANK_SIZE_192K: HSM bank size is 192K
      \arg        HSM_BANK_SIZE_208K: HSM bank size is 208K
      \arg        HSM_BANK_SIZE_224K: HSM bank size is 224K
      \arg        HSM_BANK_SIZE_240K: HSM bank size is 240K
      \arg        HSM_BANK_SIZE_256K: HSM bank size is 256K
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum hsm_bank_size_config(uint64_t hsm_size)
{
    fmc_state_enum reval = FMC_READY;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_HSM_BANK_SIZE(hsm_size)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x002DU), ERR_PARAM_INVALID);
    } else
#endif
    {
        reval = hsm_otp_doubleword_program(HSM_SIZE_ADDRESS, (uint64_t)hsm_size);
    }
    /* return the FMC state */
    return reval;
}

/*!
    \brief      HSM security enable (API_ID(0x002EU))
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum hsm_sec_enable(void)
{
    /* return the FMC state */
    return hsm_otp_doubleword_program(HSM_SEC_ADDRESS, (uint64_t)0xFFFFAA);
}

/*!
    \brief      HSM factory test mode disable (API_ID(0x002FU))
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
fmc_state_enum hsm_factory_disable(void)
{
    /* return the FMC state */
    return hsm_otp_doubleword_program(HSM_SEC_ADDRESS, (uint64_t)0xAAFFFF);
}

/*!
    \brief      HSM bank0 / bank1 size get (API_ID(0x0030U))
    \param[in]  none
    \param[out] none
    \retval     HSM bank0 / bank1 size, 0x00000000 ~ 0x00040000
*/
uint32_t hsm_bank_size_get(void)
{
    uint32_t size_value = (FMC_HSMWP & FMC_HSMWP_HSMSIZE) >> 16U;

    if(0x1FU == size_value) {
        /* 0x1F: HSM bank 0 / bank 1 size is 0 KB */
        size_value = 0U;
    } else if(0x10U <= size_value) {
        /* 0x10-0x1E: HSM bank 0 / bank 1 size is 256KB */
        size_value = 0x40000U;
    } else {
        /* 0x00-0x0F: HSM bank 0 / bank 1 size is HSMSIZE*16K */
        size_value *= 0x4000U;
    }

    return size_value;
}

/*!
    \brief      force to reload the HOST and HSM option bytes (API_ID(0x0031U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_reset(void)
{
    /* lock CTL0 */
    fmc_ctl0_unlock();
    /* set the OBRLD bit */
    FMC_CTL0 |= FMC_CTL0_OBRLD;
}

/*!
    \brief      erase the HOST option bytes (API_ID(0x0032U))
                programmer must ensure FMC & option bytes are both unlocked before calling this function
    \param[in]  none
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
      \arg        FMC_OB_HSPC: FMC is under high security protection
*/
fmc_state_enum ob_erase(void)
{
    uint32_t temp_spc_user = OB_SPC_USER;
    fmc_state_enum  fmc_state;

    /* check the option bytes security protection value */
    if(OB_OBSTAT_PLEVEL_HIGH == ob_plevel_get()) {
        fmc_state =  FMC_OB_HSPC;
    } else {
        /* wait for the FMC ready */
        fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);

        if(FMC_READY == fmc_state) {
            fmc_ctl0_unlock();
            /* write OPT logic address */
            FMC_ADDR0 = OB;
            /* start erase the option bytes */
            FMC_CTL0 |= FMC_CTL0_PER;
            FMC_CTL0 |= FMC_CTL0_START;
            /* wait for the FMC ready */
            fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
            fmc_ctl0_unlock();
            /* reset the PER bit */
            FMC_CTL0 &= ~FMC_CTL0_PER;

            if(FMC_READY == fmc_state) {
                /* set the PG bit */
                FMC_CTL0 |= FMC_CTL0_PG;
                /* restore the previous security protection configuration */
                FMC_WDATL0 = (temp_spc_user & LOW_8BITS_MASK) | LOW_8BITS_MASK1;
                FMC_WDATH0 = 0xFFFFFFFFU;
                FMC_ADDR0 = OB;
                FMC_CTL0 |= FMC_CTL0_START;
                /* wait for the FMC ready */
                fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
                fmc_ctl0_unlock();
                /* reset the PG bit */
                FMC_CTL0 &= ~FMC_CTL0_PG;
            }

