sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.c
            /* lock CTL0 */
            fmc_ctl0_lock();
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure HOST option bytes write protection (API_ID(0x0033U))
    \param[in]  wp_area: write protection area
                only one parameter can be selected which is shown as below:
      \arg        BANK0_AREA: main flash bank0 write protection area, the valid width of ob_wp is bit 31 to 0
      \arg        BANK1_AREA: main flash bank1 write protection area, the valid width of ob_wp is bit 31 to 0
      \arg        DATA_FLASH_AREA: data flash write protection area, the valid width of ob_wp is bit 7 to 0
    \param[in]  ob_wp: write protection configuration data. Notice that set the bit to 0 if you want to protect
                the corresponding pages. Other bits except the valid should be 1.
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
      \arg        FMC_OB_HSPC: FMC is under high security protection
*/
fmc_state_enum ob_write_protection_config(fmc_area_enum wp_area, uint32_t ob_wp)
{
    uint32_t i;
    uint32_t op_byte[OB_WORD_CNT] = {0};
    fmc_state_enum  fmc_state = FMC_READY;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_HOST_AREA(wp_area)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0033U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* check the option bytes security protection value */
        if(OB_OBSTAT_PLEVEL_HIGH == ob_plevel_get()) {
            fmc_state =  FMC_OB_HSPC;
        } else {
            /* read option bytes */
            for(i = 0U; i < OB_WORD_CNT; i++) {
                op_byte[i] = OP_BYTE(i);
            }

            if(BANK0_AREA == wp_area) {
                /* configure write protection to main flash bank0 area -- 0x1FFFF808 */
                op_byte[2] = (ob_wp & LOW_8BITS_MASK) | ((ob_wp & HIGH_8BITS_MASK) << 8U);
                op_byte[3] = ((ob_wp & LOW_8BITS_MASK1) >> 16U) | ((ob_wp & HIGH_8BITS_MASK1) >> 8U);
            } else if(BANK1_AREA == wp_area) {
                /* configure write protection to main flash bank1 area -- 0x1FFFF810 */
                op_byte[4] = (ob_wp & LOW_8BITS_MASK) | ((ob_wp & HIGH_8BITS_MASK) << 8U);
                op_byte[5] = ((ob_wp & LOW_8BITS_MASK1) >> 16U) | ((ob_wp & HIGH_8BITS_MASK1) >> 8U);
            } else {
                /* configure write protection to HOST data flash area -- 0x1FFFF828 */
                op_byte[10] = (ob_wp & LOW_8BITS_MASK) | HIGH_16BITS_MASK;
            }

            /* wait for the FMC ready */
            fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);

            if(FMC_READY == fmc_state) {
                fmc_ctl0_unlock();
                /* write OPT logic address */
                FMC_ADDR0 = OB;
                /* start erase the option bytes */
                FMC_CTL0 |= FMC_CTL0_PER;
                FMC_CTL0 |= FMC_CTL0_START;
                /* wait for the FMC ready */
                fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);

                fmc_ctl0_unlock();
                /* reset the PER bit */
                FMC_CTL0 &= ~FMC_CTL0_PER;

                if(FMC_READY == fmc_state) {
                    /* set the PG bit */
                    FMC_CTL0 |= FMC_CTL0_PG;
                    /* write option bytes */
                    for(i = 0U; i < OB_DOUBLEWORD_CNT; i++) {
                        FMC_WDATL0 = op_byte[i * 2U];
                        FMC_WDATH0 = op_byte[i * 2U + 1U];
                        FMC_ADDR0 = OB + i * 8U;
                        FMC_CTL0 |= FMC_CTL0_START;
                        /* wait for the FMC ready */
                        fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
                        if(FMC_READY != fmc_state) {
                            break;
                        }
                        fmc_ctl0_unlock();
                    }
                    /* wait for the FMC ready */
                    fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
                    fmc_ctl0_unlock();
                    /* reset the PG bit */
                    FMC_CTL0 &= ~FMC_CTL0_PG;
                }
            }

            /* lock CTL0 */
            fmc_ctl0_lock();
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure HOST system security protection (API_ID(0x0034U))
    \param[in]  ob_spc: specify security protection code
                only one parameter can be selected which is shown as below:
      \arg        FMC_NSPC: no security protection
      \arg        FMC_LSPC: low security protection
      \arg        FMC_HSPC: high security protection
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
      \arg        FMC_OB_HSPC: FMC is under high security protection
*/
fmc_state_enum ob_security_protection_config(uint16_t ob_spc)
{
    uint32_t i;
    uint32_t op_byte[OB_WORD_CNT] = {0};
    fmc_state_enum  fmc_state = FMC_READY;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_SPC_VALUE(ob_spc)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0034U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* check the option bytes security protection value */
        if(OB_OBSTAT_PLEVEL_HIGH == ob_plevel_get()) {
            fmc_state = FMC_OB_HSPC;
        } else {
            /* read option bytes */
            for(i = 0U; i < OB_WORD_CNT; i++) {
                op_byte[i] = OP_BYTE(i);
            }

