sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.c
            op_byte[0] = ((uint32_t)(ob_spc)) | ((op_byte[0] & HIGH_16BITS_MASK));
            /* wait for the FMC ready */
            fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);

            if(FMC_READY == fmc_state) {
                fmc_ctl0_unlock();
                /* write OPT logic address */
                FMC_ADDR0 = OB;
                /* start erase the option bytes */
                FMC_CTL0 |= FMC_CTL0_PER;
                FMC_CTL0 |= FMC_CTL0_START;
                /* wait for the FMC ready */
                fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
                fmc_ctl0_unlock();
                /* reset the PER bit */
                FMC_CTL0 &= ~FMC_CTL0_PER;

                if(FMC_READY == fmc_state) {
                    /* enable the option bytes programming */
                    FMC_CTL0 |= FMC_CTL0_PG;
                    /* write option bytes */
                    for(i = 0U; i < OB_DOUBLEWORD_CNT; i++) {
                        FMC_WDATL0 = op_byte[i * 2U];
                        FMC_WDATH0 = op_byte[i * 2U + 1U];
                        FMC_ADDR0 = OB + i * 8U;
                        FMC_CTL0 |= FMC_CTL0_START;
                        /* wait for the FMC ready */
                        fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
                        if(FMC_READY != fmc_state) {
                            break;
                        }
                        fmc_ctl0_unlock();
                    }
                    /* wait for the FMC ready */
                    fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
                    fmc_ctl0_unlock();
                    /* reset the PG bit */
                    FMC_CTL0 &= ~FMC_CTL0_PG;
                }
            }

            /* lock CTL0 */
            fmc_ctl0_lock();
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      program the user HOST option bytes (API_ID(0x0035U))
                programmer must ensure FMC & option bytes are both unlocked before calling this function
                this function can only clear the corresponding bits to be 0 rather than 1.
                the function ob_erase is used to set all the bits to be 1.
    \param[in]  ob_user: user option bytes
                one or more (bitwise OR) parameters can be selected which are shown as below:
      \arg        OB_FWDGT0_HW/OB_FWDGT0_SW: free watchdog 0 mode
      \arg        OB_STDBY_RST/OB_STDBY_NRST: generate a reset or enter standby mode
      \arg        OB_FWDGT1_HW/OB_FWDGT1_SW: free watchdog 1 mode
      \arg        OB_FWDG_STDBY_STOP/OB_FWDG_STDBY_CONT: free watchdog 0/1 stop or continue counting in standby mode
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
      \arg        FMC_OB_HSPC: FMC is under high security protection
*/
fmc_state_enum ob_user_write(uint16_t ob_user)
{
    uint32_t i;
    uint32_t op_byte[OB_WORD_CNT] = {0};
    uint8_t ob_user_0, ob_user_1, ob_user_temp;
    fmc_state_enum fmc_state;

    /* check the option bytes security protection value */
    if(OB_OBSTAT_PLEVEL_HIGH == ob_plevel_get()) {
        fmc_state =  FMC_OB_HSPC;
    } else {
        ob_user_0 = (uint8_t)(ob_user >> 8U);
        ob_user_1 = (uint8_t)(ob_user & 0xFFU);

        /* read option bytes */
        for(i = 0U; i < OB_WORD_CNT; i++) {
            op_byte[i] = OP_BYTE(i);
        }

        ob_user_temp = (uint8_t)(op_byte[0] >> 16U);
        ob_user_temp |= ob_user_1;
        ob_user_temp &= (uint8_t)(~ob_user_0);
        op_byte[0] = ((uint32_t)ob_user_temp << 16U) | ((op_byte[0] & LOW_16BITS_MASK));
        /* check whether FMC is ready or not */
        fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);

        if(FMC_READY == fmc_state) {
            fmc_ctl0_unlock();
            /* write OPT logic address */
            FMC_ADDR0 = OB;
            /* start erase the option bytes */
            FMC_CTL0 |= FMC_CTL0_PER;
            FMC_CTL0 |= FMC_CTL0_START;
            /* wait for the FMC ready */
            fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
            fmc_ctl0_unlock();
            /* reset the PER bit */
            FMC_CTL0 &= ~FMC_CTL0_PER;

            if(FMC_READY == fmc_state) {
                /* enable the option bytes programming */
                FMC_CTL0 |= FMC_CTL0_PG;
                /* write option bytes */
                for(i = 0U; i < OB_DOUBLEWORD_CNT; i++) {
                    FMC_WDATL0 = op_byte[i * 2U];
                    FMC_WDATH0 = op_byte[i * 2U + 1U];
                    FMC_ADDR0 = OB + i * 8U;
                    FMC_CTL0 |= FMC_CTL0_START;
                    /* wait for the FMC ready */
                    fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
                    if(FMC_READY != fmc_state) {
                        break;
                    }
                    fmc_ctl0_unlock();
                }
                /* wait for the FMC ready */
                fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
                /* reset the PG bit */
                FMC_CTL0 &= ~FMC_CTL0_PG;
            }
        }

        /* lock CTL0 */
        fmc_ctl0_lock();
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      program the data HOST option bytes (API_ID(0x0036U))
                programmer must ensure FMC & option bytes are both unlocked before calling this function
    \param[in]  ob_data: the data to be programmed, OB_DATA[0:15]
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
      \arg        FMC_OB_HSPC: FMC is under high security protection
*/
fmc_state_enum ob_data_program(uint16_t ob_data)
{
    uint32_t i;
    uint32_t val;
    uint32_t op_byte[OB_WORD_CNT] = {0};
    fmc_state_enum fmc_state;

    /* check the option bytes security protection value */
    if(OB_OBSTAT_PLEVEL_HIGH == ob_plevel_get()) {
        fmc_state =  FMC_OB_HSPC;
    } else {
        /* read option bytes */
        for(i = 0U; i < OB_WORD_CNT; i++) {
            op_byte[i] = OP_BYTE(i);
        }

