sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.c
        val = (uint32_t)(ob_data & LOW_8BITS_MASK);
        val |= ((uint32_t)ob_data & HIGH_8BITS_MASK) << 8U;
        op_byte[1] = val;
        /* wait for the FMC ready */
        fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);

        if(FMC_READY == fmc_state) {
            fmc_ctl0_unlock();
            /* write OPT logic address */
            FMC_ADDR0 = OB;
            /* start erase the option bytes */
            FMC_CTL0 |= FMC_CTL0_PER;
            FMC_CTL0 |= FMC_CTL0_START;
            /* wait for the FMC ready */
            fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
            fmc_ctl0_unlock();
            /* reset the PER bit */
            FMC_CTL0 &= ~FMC_CTL0_PER;

            if(FMC_READY == fmc_state) {
                /* set the OB0PG bit */
                FMC_CTL0 |= FMC_CTL0_PG;
                /* write option bytes */
                for(i = 0U; i < OB_DOUBLEWORD_CNT; i++) {
                    FMC_WDATL0 = op_byte[i * 2U];
                    FMC_WDATH0 = op_byte[i * 2U + 1U];
                    FMC_ADDR0 = OB + i * 8U;
                    FMC_CTL0 |= FMC_CTL0_START;
                    /* wait for the FMC ready */
                    fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
                    if(FMC_READY != fmc_state) {
                        break;
                    }
                    fmc_ctl0_unlock();
                }
                /* wait for the FMC ready */
                fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
                /* reset the OB0PG bit */
                FMC_CTL0 &= ~FMC_CTL0_PG;
            }
        }

        /* lock CTL0 */
        fmc_ctl0_lock();
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      program the cltcfg HOST option bytes (API_ID(0x0037U))
    \param[in]  ob_cltcfg: cltcfg module configuration data, the valid width is bit 47 to 0
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
      \arg        FMC_OB_HSPC: FMC is under high security protection
*/
fmc_state_enum ob_cltcfg_config(uint64_t ob_cltcfg)
{
    uint32_t i;
    uint32_t op_byte[OB_WORD_CNT] = {0};
    fmc_state_enum  fmc_state;

    /* check the option bytes security protection value */
    if(OB_OBSTAT_PLEVEL_HIGH == ob_plevel_get()) {
        fmc_state = FMC_OB_HSPC;
    } else {
        /* read option bytes */
        for(i = 0U; i < OB_WORD_CNT; i++) {
            op_byte[i] = OP_BYTE(i);
        }

        /* configure CLTCFG data [23:0] -- 0x1FFFF82A */
        op_byte[10] = (uint32_t)(((ob_cltcfg & LOW_8BITS_MASK) << 16) | LOW_8BITS_MASK);
        op_byte[11] = (uint32_t)(((ob_cltcfg & HIGH_8BITS_MASK) >> 8) | (ob_cltcfg & LOW_8BITS_MASK1));
        /* configure CLTCFG data [47:24] -- 0x1FFFF830 */
        op_byte[12] = (uint32_t)(((ob_cltcfg >> 24) & LOW_8BITS_MASK) | (((ob_cltcfg >> 24) &
                                                                          HIGH_8BITS_MASK) << 8));
        op_byte[13] = (uint32_t)(((ob_cltcfg >> 24) & LOW_8BITS_MASK1) >> 16) | HIGH_16BITS_MASK;
        /* wait for the FMC ready */
        fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);

        if(FMC_READY == fmc_state) {
            fmc_ctl0_unlock();
            /* write OPT logic address */
            FMC_ADDR0 = OB;
            /* start erase the option bytes */
            FMC_CTL0 |= FMC_CTL0_PER;
            FMC_CTL0 |= FMC_CTL0_START;
            /* wait for the FMC ready */
            fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
            fmc_ctl0_unlock();
            /* reset the PER bit */
            FMC_CTL0 &= ~FMC_CTL0_PER;

            if(FMC_READY == fmc_state) {
                /* set the PG bit */
                FMC_CTL0 |= FMC_CTL0_PG;
                /* write option bytes */
                for(i = 0U; i < OB_DOUBLEWORD_CNT; i++) {
                    FMC_WDATL0 = op_byte[i * 2U];
                    FMC_WDATH0 = op_byte[i * 2U + 1U];
                    FMC_ADDR0 = OB + i * 8U;
                    FMC_CTL0 |= FMC_CTL0_START;
                    /* wait for the FMC ready */
                    fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
                    if(FMC_READY != fmc_state) {
                        break;
                    }
                    fmc_ctl0_unlock();
                }
                /* wait for the FMC ready */
                fmc_state = fmc_ctl0_ready_wait(FMC_TIMEOUT_COUNT);
                /* reset the PG bit */
                FMC_CTL0 &= ~FMC_CTL0_PG;
            }
        }

        /* lock CTL0 */
        fmc_ctl0_lock();
    }

    /* return the FMC state */
    return fmc_state;
}


/*!
    \brief      get the value of FMC option bytes OB_USER in FMC_OBSTAT register (API_ID(0x0038U))
    \param[in]  none
    \param[out] none
    \retval     the option bytes USER value,0x00-0xFF
*/
uint8_t ob_user_get(void)
{
    return (uint8_t)((FMC_OBSTAT & FMC_OBSTAT_USER) >> OBSTAT_USER_OFFSET);
}

/*!
    \brief      get the value of FMC option bytes OB_DATA in FMC_OBSTAT register (API_ID(0x0039U))
    \param[in]  none
    \param[out] none
    \retval     the option bytes DATA value, 0x0000-0xFFFF
*/
uint16_t ob_data_get(void)
{
    return (uint16_t)((FMC_OBSTAT & FMC_OBSTAT_DATA) >> OBSTAT_DATA_OFFSET);
}

/*!
    \brief      get the value of FMC option bytes BK0WP in FMC_WP0 register (API_ID(0x003AU))
    \param[in]  none
    \param[out] none
    \retval     the option bytes BK0WP value, 0x00000000-0xFFFFFFFF
*/
uint32_t ob_bk0_write_protection_get(void)
{
    return (uint32_t)(FMC_WP0);
}

/*!
    \brief      get the value of FMC option bytes BK1WP in FMC_WP1 register (API_ID(0x003BU))
    \param[in]  none
    \param[out] none
    \retval     the option bytes BK1WP value, 0x00000000-0xFFFFFFFF
*/
uint32_t ob_bk1_write_protection_get(void)
{
    return (uint32_t)(FMC_WP1);
}

/*!
    \brief      get the value of FMC option bytes DFWP in FMC_WP2 register (API_ID(0x003CU))
    \param[in]  none
    \param[out] none
    \retval     the option bytes DFWP value, 0x00-0xFF
*/
uint8_t ob_df_write_protection_get(void)
{
    return (uint8_t)(FMC_WP2);
}

/*!
    \brief      get the value of FMC option bytes security protection level (PLEVEL) in FMC_OBSTAT register (API_ID(0x003DU))
    \param[in]  none
    \param[out] none
    \retval     the value of PLEVEL
      \arg        OB_OBSTAT_PLEVEL_NO: no security protection
      \arg        OB_OBSTAT_PLEVEL_LOW: low security protection
      \arg        OB_OBSTAT_PLEVEL_HIGH: high security protection
*/
uint8_t ob_plevel_get(void)
{
    return (uint8_t)((FMC_OBSTAT & FMC_OBSTAT_PLEVEL) >> OBSTAT_PLEVEL_OFFSET);
}

/*!
    \brief      erase the HSM option bytes (API_ID(0x003EU))
                programmer must ensure FMC & option bytes are both unlocked before calling this function
    \param[in]  none
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
      \arg        FMC_OB_HSPC: FMC is under high security protection
      \arg        FMC_HSMOB_HSPC: FMC HSM system is under high security protection
*/
fmc_state_enum hsm_ob_erase(void)
{
    uint32_t temp_spc_user = OB_HSMSPC;
    fmc_state_enum  fmc_state;

    /* check the option bytes security protection value */
    if(HSM_OBSTAT_PLEVEL_HIGH == hsm_ob_spc_get()) {
        fmc_state =  FMC_HSMOB_HSPC;
    } else {
        /* wait for the FMC ready */
        fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);

        if(FMC_READY == fmc_state) {
            fmc_ctl1_unlock();
            /* write OPT logic address */
            FMC_ADDR1 = HSM_OB;
            /* start erase the option bytes */
            FMC_CTL1 |= FMC_CTL1_PER;
            FMC_CTL1 |= FMC_CTL1_START;
            /* wait for the FMC ready */
            fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
            fmc_ctl1_unlock();
            /* reset the PER bit */
            FMC_CTL1 &= ~FMC_CTL1_PER;

            if(FMC_READY == fmc_state) {
                /* set the PG bit */
                FMC_CTL1 |= FMC_CTL1_PG;
                /* restore the previous HSM size and security protection configuration */
                FMC_WDATL1 = (uint32_t)((temp_spc_user << 16) | LOW_16BITS_MASK);
                FMC_WDATH1 = 0xFFFFFFFFU;
                FMC_ADDR1 = HSM_OB;
                FMC_CTL1 |= FMC_CTL1_START;
                /* wait for the FMC ready */
                fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
                fmc_ctl1_unlock();
                /* reset the PG bit */
                FMC_CTL1 &= ~FMC_CTL1_PG;
            }
        }

        /* lock CTL1 */
        fmc_ctl1_lock();
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      initialize the hsm option bytes parameters struct with the default values (API_ID(0x003FU))
    \param[in]  init_struct: the initialization data needed to initialize hsm option bytes
    \param[out] none
    \retval     none
*/
void hsm_ob_para_struct_init(fmc_hsm_opt_parameter_struct *init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x003FU), ERR_PARAM_POINTER);
    } else
#endif
    {
        init_struct->ob_hsmuser.hsm_user = 0xFF;
        init_struct->ob_hsmspc = 0xA5;
        init_struct->ob_hsmpfwp = 0xFF;
        init_struct->ob_hsmdfwp = 0xFF;
    }
}

/*!
    \brief      configure HSM option bytes (API_ID(0x0040U))
    \param[in]  hsmob: the data needed to initialize hsm option bytes
                  ob_hsmuser: hsm option bytes hsmuser fields
                  ob_hsmspc: hsm option bytes hsmspc fields
                  ob_hsmpfwp: hsm option bytes hsmpfwp fields
                  ob_hsmdfwp: hsm option bytes hsmdfwp fields
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
      \arg        FMC_OB_HSPC: FMC is under high security protection
*/
fmc_state_enum hsm_ob_config(fmc_hsm_opt_parameter_struct *hsmob)
{
    uint32_t i;
    uint32_t hsmop_byte[HSM_OB_WORD_CNT] = {0};
    fmc_state_enum  fmc_state = FMC_READY;

