sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(hsmob)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0040U), ERR_PARAM_POINTER);
    } else
#endif
    {
        /* check the HSM option bytes security protection value */
        if(HSM_OBSTAT_PLEVEL_HIGH == hsm_ob_spc_get()) {
            fmc_state =  FMC_HSMOB_HSPC;
        } else {
            /* modify HSM option bytes */
            hsmop_byte[0] = ((uint32_t)(hsmob->ob_hsmuser.hsm_user) | ((uint32_t)hsmob->ob_hsmspc << 16U));
            hsmop_byte[1] = ((uint32_t)(hsmob->ob_hsmpfwp) | ((uint32_t)hsmob->ob_hsmdfwp << 16U));

            /* wait for the FMC ready */
            fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);

            if(FMC_READY == fmc_state) {
                fmc_ctl1_unlock();
                /* write HSM OPT logic address */
                FMC_ADDR1 = HSM_OB;
                /* start erase the option bytes */
                FMC_CTL1 |= FMC_CTL1_PER;
                FMC_CTL1 |= FMC_CTL1_START;
                /* wait for the FMC ready */
                fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
                fmc_ctl1_unlock();
                /* reset the PER bit */
                FMC_CTL1 &= ~FMC_CTL1_PER;

                if(FMC_READY == fmc_state) {
                    /* set the PG bit */
                    FMC_CTL1 |= FMC_CTL1_PG;

                    /* write option bytes */
                    for(i = 0U; i < HSM_OB_DOUBLEWORD_CNT; i++) {
                        FMC_WDATL1 = hsmop_byte[i * 2U];
                        FMC_WDATH1 = hsmop_byte[i * 2U + 1U];
                        FMC_ADDR1 = HSM_OB + i * 8U;
                        FMC_CTL1 |= FMC_CTL1_START;
                        fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
                        if(FMC_READY != fmc_state) {
                            break;
                        }
                        fmc_ctl1_unlock();
                    }
                    /* wait for the FMC ready */
                    fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
                    /* reset the PG bit */
                    FMC_CTL1 &= ~FMC_CTL1_PG;
                }
            }

            /* lock CTL1 */
            fmc_ctl1_lock();
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure HSM option bytes write protection (API_ID(0x0041U))
    \param[in]  wp_area: write protection area
                only one parameter can be selected which is shown as below:
      \arg        HSM_BANK_AREA: HSM bank0/bank1 write protection area
      \arg        HSM_DATA_AREA: HSM data flash write protection areas
    \param[in]  ob_wp: write protection configuration data. Notice that set the bit to 0 if you want to protect
                the corresponding pages. Other bits except the valid should be 1.
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
      \arg        FMC_OB_HSPC: FMC is under high security protection
*/
fmc_state_enum hsm_ob_write_protection_config(fmc_area_enum wp_area, uint8_t ob_hsmwp)
{
    uint32_t i;
    uint32_t hsmop_byte[HSM_OB_WORD_CNT] = {0U};
    uint32_t wp_temp;
    fmc_state_enum  fmc_state = FMC_READY;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_HSM_AREA(wp_area)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0041U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* check the option bytes security protection value */
        if(HSM_OBSTAT_PLEVEL_HIGH == hsm_ob_spc_get()) {
            fmc_state =  FMC_HSMOB_HSPC;
        } else {
            /* read option bytes */
            for(i = 0U; i < HSM_OB_WORD_CNT; i++) {
                hsmop_byte[i] = HSMOP_BYTE(i);
            }

            if(HSM_BANK_AREA == wp_area) {
                /* configure write protection to HSM Pflash area -- 0x1FFFF884 */
                wp_temp = hsmop_byte[1] & 0xFFFFFF00U;
                hsmop_byte[1] = (wp_temp | ob_hsmwp);
            } else {
                /* configure write protection to HSM Dflash area -- 0x1FFFF886 */
                wp_temp = hsmop_byte[1] & 0xFF00FFFFU;
                hsmop_byte[1] = (wp_temp | (((uint32_t)ob_hsmwp) << 16U));
            }

            /* wait for the FMC ready */
            fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);

            if(FMC_READY == fmc_state) {
                fmc_ctl1_unlock();
                /* write HSM OPT logic address */
                FMC_ADDR1 = HSM_OB;
                /* start erase the option bytes */
                FMC_CTL1 |= FMC_CTL1_PER;
                FMC_CTL1 |= FMC_CTL1_START;
                /* wait for the FMC ready */
                fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
                fmc_ctl1_unlock();
                /* reset the PER bit */
                FMC_CTL1 &= ~FMC_CTL1_PER;

                if(FMC_READY == fmc_state) {
                    /* set the PG bit */
                    FMC_CTL1 |= FMC_CTL1_PG;
                    /* write option bytes */
                    for(i = 0U; i < HSM_OB_DOUBLEWORD_CNT; i++) {
                        FMC_WDATL1 = hsmop_byte[i * 2U];
                        FMC_WDATH1 = hsmop_byte[i * 2U + 1U];
                        FMC_ADDR1 = HSM_OB + i * 8U;
                        FMC_CTL1 |= FMC_CTL1_START;
                        fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);

                        if(FMC_READY != fmc_state) {
                            break;
                        }
                        fmc_ctl1_unlock();
                    }
                    /* wait for the FMC ready */
                    fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
                    fmc_ctl1_unlock();
                    /* reset the PG bit */
                    FMC_CTL1 &= ~FMC_CTL1_PG;
                }
            }

            /* lock CTL1 */
            fmc_ctl1_lock();
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure security protection in HSM option bytes (API_ID(0x0042U))
    \param[in]  ob_spc: specify security protection code
                only one parameter can be selected which is shown as below:
      \arg        HSM_NSPC: no security protection
      \arg        HSM_LSPC: low security protection
      \arg        HSM_HSPC: high security protection
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
      \arg        FMC_OB_HSPC: FMC is under high security protection
*/
fmc_state_enum hsm_ob_security_protection_config(uint16_t ob_hsmspc)
{
    uint32_t i;
    uint32_t hsmop_byte[HSM_OB_WORD_CNT] = {0};
    fmc_state_enum  fmc_state = FMC_READY;

