sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_HSM_SPC_VALUE(ob_hsmspc)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0042U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* check the option bytes security protection value */
        if(HSM_OBSTAT_PLEVEL_HIGH == hsm_ob_spc_get()) {
            fmc_state =  FMC_HSMOB_HSPC;
        } else {
            /* read option bytes */
            for(i = 0U; i < HSM_OB_WORD_CNT; i++) {
                hsmop_byte[i] = HSMOP_BYTE(i);
            }

            hsmop_byte[0] = ((uint32_t)((uint32_t)ob_hsmspc << 16U)) | LOW_16BITS_MASK;
            /* wait for the FMC ready */
            fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);

            if(FMC_READY == fmc_state) {
                fmc_ctl1_unlock();
                /* write HSM OPT logic address */
                FMC_ADDR1 = HSM_OB;
                /* start erase the option bytes */
                FMC_CTL1 |= FMC_CTL1_PER;
                FMC_CTL1 |= FMC_CTL1_START;
                /* wait for the FMC ready */
                fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
                fmc_ctl1_unlock();
                /* reset the PER bit */
                FMC_CTL1 &= ~FMC_CTL1_PER;

                if(FMC_READY == fmc_state) {
                    /* set the PG bit */
                    FMC_CTL1 |= FMC_CTL1_PG;
                    /* write option bytes */
                    for(i = 0U; i < HSM_OB_DOUBLEWORD_CNT; i++) {
                        FMC_WDATL1 = hsmop_byte[i * 2U];
                        FMC_WDATH1 = hsmop_byte[i * 2U + 1U];
                        FMC_ADDR1 = HSM_OB + i * 8U;
                        FMC_CTL1 |= FMC_CTL1_START;
                        fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
                        if(FMC_READY != fmc_state) {
                            break;
                        }
                        fmc_ctl1_unlock();
                    }
                    /* wait for the FMC ready */
                    fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
                    fmc_ctl1_unlock();
                    /* reset the PG bit */
                    FMC_CTL1 &= ~FMC_CTL1_PG;
                }
            }

            /* lock CTL1 */
            fmc_ctl1_lock();
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure swap in HSM option bytes (API_ID(0x0043U))
    \param[in]  hsmob_swap: user option bytes
                only one parameter parameters can be selected which are shown as below:
      \arg        HSM_OB_SWAP_PFLASH0: bank0 and HSM bank 0 at Pflash0, bank1 and HSM bank 1 at Pflash1
      \arg        HSM_OB_SWAP_PFLASH1: After swap, bank0 and HSM bank 0 at Pflash1, bank1 and HSM bank 1 at Pflash0
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
      \arg        FMC_OB_HSPC: FMC is under high security protection
*/
fmc_state_enum hsm_ob_swap_config(uint16_t hsmob_swap)
{
    uint32_t i;
    uint32_t hsmop_byte[HSM_OB_WORD_CNT] = {0};
    fmc_state_enum  fmc_state = FMC_READY;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_HSM_SWAP_VALUE(hsmob_swap)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0043U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* check the HSM option bytes security protection value */
        if(HSM_OBSTAT_PLEVEL_HIGH == hsm_ob_spc_get()) {
            fmc_state =  FMC_HSMOB_HSPC;
        } else {
            /* read HSM option bytes */
            for(i = 0U; i < HSM_OB_WORD_CNT; i++) {
                hsmop_byte[i] = HSMOP_BYTE(i);
            }

            if(HSM_OB_SWAP_PFLASH1 == hsmob_swap) {
                hsmop_byte[0] &= (uint32_t)(~hsmob_swap);
            } else {
                hsmop_byte[0] |= (uint32_t)((uint32_t)hsmob_swap >> 8U);
            }

            /* wait for the FMC ready */
            fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);

            if(FMC_READY == fmc_state) {
                fmc_ctl1_unlock();
                /* write HSM OPT logic address */
                FMC_ADDR1 = HSM_OB;
                /* start erase the option bytes */
                FMC_CTL1 |= FMC_CTL1_PER;
                FMC_CTL1 |= FMC_CTL1_START;
                /* wait for the FMC ready */
                fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
                fmc_ctl1_unlock();
                /* reset the PER bit */
                FMC_CTL1 &= ~FMC_CTL1_PER;

                if(FMC_READY == fmc_state) {
                    /* set the PG bit */
                    FMC_CTL1 |= FMC_CTL1_PG;

                    /* write option bytes */
                    for(i = 0U; i < HSM_OB_DOUBLEWORD_CNT; i++) {
                        FMC_WDATL1 = hsmop_byte[i * 2U];
                        FMC_WDATH1 = hsmop_byte[i * 2U + 1U];
                        FMC_ADDR1 = HSM_OB + i * 8U;
                        FMC_CTL1 |= FMC_CTL1_START;
                        fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
                        if(FMC_READY != fmc_state) {
                            break;
                        }
                        fmc_ctl1_unlock();
                    }
                    /* wait for the FMC ready */
                    fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
                    /* reset the PG bit */
                    FMC_CTL1 &= ~FMC_CTL1_PG;
                }
            }

            /* lock CTL1 */
            fmc_ctl1_lock();
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure window watchdog in HSM option bytes (API_ID(0x0044U))
    \param[in]  hsmob_user: user option bytes
                only one parameter parameters can be selected which are shown as below:
      \arg        HSM_OB_WWDG_HW: HSM hardware window watchdog
      \arg        HSM_OB_WWDG_SW: HSM software window watchdog
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
      \arg        FMC_OB_HSPC: FMC is under high security protection
*/
fmc_state_enum hsm_ob_wwdg_config(uint16_t hsmob_wwdg)
{
    uint32_t i;
    uint32_t hsmop_byte[HSM_OB_WORD_CNT] = {0};
    fmc_state_enum  fmc_state = FMC_READY;

