sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_HSM_WWDG_VALUE(hsmob_wwdg)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0044U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* check the HSM option bytes security protection value */
        if(HSM_OBSTAT_PLEVEL_HIGH == hsm_ob_spc_get()) {
            fmc_state = FMC_HSMOB_HSPC;
        } else {
            /* read HSM option bytes */
            for(i = 0U; i < HSM_OB_WORD_CNT; i++) {
                hsmop_byte[i] = HSMOP_BYTE(i);
            }

            if(HSM_OB_WWDG_HW == hsmob_wwdg) {
                hsmop_byte[0] &= (uint32_t)(~(hsmob_wwdg >> 8U));
            } else {
                hsmop_byte[0] |= (uint32_t)(hsmob_wwdg);
            }

            /* wait for the FMC ready */
            fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);

            if(FMC_READY == fmc_state) {
                fmc_ctl1_unlock();
                /* write HSM OPT logic address */
                FMC_ADDR1 = HSM_OB;
                /* start erase the option bytes */
                FMC_CTL1 |= FMC_CTL1_PER;
                FMC_CTL1 |= FMC_CTL1_START;
                /* wait for the FMC ready */
                fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
                fmc_ctl1_unlock();
                /* reset the PER bit */
                FMC_CTL1 &= ~FMC_CTL1_PER;

                if(FMC_READY == fmc_state) {
                    /* set the PG bit */
                    FMC_CTL1 |= FMC_CTL1_PG;
                    /* write option bytes */
                    for(i = 0U; i < HSM_OB_DOUBLEWORD_CNT; i++) {
                        FMC_WDATL1 = hsmop_byte[i * 2U];
                        FMC_WDATH1 = hsmop_byte[i * 2U + 1U];
                        FMC_ADDR1 = HSM_OB + i * 8U;
                        FMC_CTL1 |= FMC_CTL1_START;
                        fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
                        if(FMC_READY != fmc_state) {
                            break;
                        }
                        fmc_ctl1_unlock();
                    }
                    /* wait for the FMC ready */
                    fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
                    /* reset the PG bit */
                    FMC_CTL1 &= ~FMC_CTL1_PG;
                }
            }

            /* lock CTL1 */
            fmc_ctl1_lock();
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      program the user data in HSM option bytes (API_ID(0x0045U))
    \param[in]  hsmob_user: the data to be programmed, OB_HSM_USER[5:0]
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
      \arg        FMC_OB_HSPC: FMC is under high security protection
*/
fmc_state_enum hsm_ob_user_write(uint8_t hsmob_user)
{
    uint32_t i;
    uint32_t hsmop_byte[HSM_OB_WORD_CNT] = {0};
    fmc_state_enum  fmc_state = FMC_READY;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_HSM_HSMUSER_VALUE(hsmob_user)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0045U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* check the HSM option bytes security protection value */
        if(HSM_OBSTAT_PLEVEL_HIGH == hsm_ob_spc_get()) {
            fmc_state = FMC_HSMOB_HSPC;
        } else {
            /* read HSM option bytes */
            for(i = 0U; i < HSM_OB_WORD_CNT; i++) {
                hsmop_byte[i] = HSMOP_BYTE(i);
            }

            hsmop_byte[0] &= ~(0x3FU);
            hsmop_byte[0] |= ((uint32_t)hsmob_user & 0x3FU);

            /* wait for the FMC ready */
            fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);

            if(FMC_READY == fmc_state) {
                fmc_ctl1_unlock();
                /* write HSM OPT logic address */
                FMC_ADDR1 = HSM_OB;
                /* start erase the option bytes */
                FMC_CTL1 |= FMC_CTL1_PER;
                FMC_CTL1 |= FMC_CTL1_START;
                /* wait for the FMC ready */
                fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
                fmc_ctl1_unlock();
                /* reset the PER bit */
                FMC_CTL1 &= ~FMC_CTL1_PER;

                if(FMC_READY == fmc_state) {
                    /* set the PG bit */
                    FMC_CTL1 |= FMC_CTL1_PG;
                    /* write option bytes */
                    for(i = 0U; i < HSM_OB_DOUBLEWORD_CNT; i++) {
                        FMC_WDATL1 = hsmop_byte[i * 2U];
                        FMC_WDATH1 = hsmop_byte[i * 2U + 1U];
                        FMC_ADDR1 = HSM_OB + i * 8U;
                        FMC_CTL1 |= FMC_CTL1_START;
                        fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
                        if(FMC_READY != fmc_state) {
                            break;
                        }
                        fmc_ctl1_unlock();
                    }
                    /* wait for the FMC ready */
                    fmc_state = fmc_ctl1_ready_wait(FMC_TIMEOUT_COUNT);
                    /* reset the PG bit */
                    FMC_CTL1 &= ~FMC_CTL1_PG;
                }
            }

            /* lock CTL1 */
            fmc_ctl1_lock();
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      get the value of FMC HSM option bytes HSMPFWP in FMC_HSMWP register (API_ID(0x0046U))
    \param[in]  none
    \param[out] none
    \retval     the option bytes OB_HSMPFWP value (0x00 - 0xFF)
*/
uint8_t hsm_ob_pflash_write_protection_get(void)
{
    return (uint8_t)(FMC_HSMWP & FMC_HSMWP_HSMPFWP);
}

/*!
    \brief      get the value of FMC HSM option bytes HSMDFWP in FMC_HSMWP register (API_ID(0x0047U))
    \param[in]  none
    \param[out] none
    \retval     the option bytes OB_HSMDFWP value (0x00 - 0xFF)
*/
uint8_t hsm_ob_df_write_protection_get(void)
{
    return (uint8_t)((FMC_HSMWP & FMC_HSMWP_HSMDFWP) >> 8U);
}

/*!
    \brief      get the value of HSM option bytes security protection level in FMC_HSMOBSTAT register (API_ID(0x0048U))
    \param[in]  none
    \param[out] none
    \retval     the value of OB_HSMSPC
      \arg        HSM_OBSTAT_PLEVEL_NO: HSM system no security protection
      \arg        HSM_OBSTAT_PLEVEL_LOW: HSM system low security protection
      \arg        HSM_OBSTAT_PLEVEL_HIGH: HSM system high security protection
*/
uint8_t hsm_ob_spc_get(void)
{
    uint8_t spc_val = (uint8_t)((FMC_HSMOBSTAT & FMC_HSMOBSTAT_SPC) >> HSMOBSTAT_SPC_OFFSET);
    uint8_t hsm_ob_plevel;

    if((uint8_t)0xA5 == spc_val) {
        hsm_ob_plevel = HSM_OBSTAT_PLEVEL_NO;
    } else if((uint8_t)0xCC == spc_val) {
        hsm_ob_plevel = HSM_OBSTAT_PLEVEL_HIGH;
    } else {
        hsm_ob_plevel = HSM_OBSTAT_PLEVEL_LOW;
    }
    return hsm_ob_plevel;
}

/*!
    \brief      get the value of HSM option bytes BSWAP in FMC_HSMOBSTAT register (API_ID(0x0049U))
    \param[in]  none
    \param[out] none
    \retval     the value of BSWAP, 0 or 1
*/
uint8_t hsm_ob_swap_get(void)
{
    return (uint8_t)(((FMC_HSMOBSTAT >> 23U) & 0x01U));
}

/*!
    \brief      get FMC flag status (API_ID(0x004AU))
    \param[in]  flag: FMC flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_STAT0_FLAG_BUSY: flash stat0 busy flag
      \arg        FMC_STAT0_FLAG_PGSERR: flash stat0 program sequence error flag
      \arg        FMC_STAT0_FLAG_PGERR: flash stat0 program error flag
      \arg        FMC_STAT0_FLAG_WPERR: flash stat0 erase/program protection error flag
      \arg        FMC_STAT0_FLAG_END: flash stat0 end of operation flag
      \arg        FMC_STAT0_FLAG_CBCMDERR: flash stat0 checked area by the check blank command is all 0xFF or not flag
      \arg        FMC_STAT0_FLAG_LOADECCERR: uncorrected ECC error when load flag
      \arg        FMC_STAT0_FLAG_COMPERR: flash stat0 complement error flag
      \arg        FMC_STAT0_FLAG_TMRERR: flash stat0 TMR error flag
      \arg        FMC_STAT0_FLAG_RSTERR: flash stat0 POR or system reset during erase/program flag
      \arg        FMC_STAT1_FLAG_BUSY: flash stat1 busy flag
      \arg        FMC_STAT1_FLAG_PGSERR: flash stat1 program sequence error flag
      \arg        FMC_STAT1_FLAG_PGERR: flash stat1 program error flag
      \arg        FMC_STAT1_FLAG_WPERR: flash stat1 erase/program protection error flag
      \arg        FMC_STAT1_FLAG_END: flash stat1 end of operation flag
      \arg        FMC_STAT1_FLAG_CBCMDERR: flash stat1 checked area by the check blank command is all 0xFF or not flag
      \arg        FMC_STAT1_FLAG_TMRERR: flash stat1 TMR error flag
      \arg        FMC_STAT1_FLAG_RSTERR: flash bank1 POR or system reset during erase/program flag
      \arg        FMC_FLAG_OBERR: option bytes 0 error flag
      \arg        FMC_FLAG_HSMOBERR: option bytes 1 read error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmc_flag_get(fmc_flag_enum flag)
{
    FlagStatus flag_temp = RESET;

