sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_FLAG(flag)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x004AU), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* get flag */
        if(0U != (FMC_REG_VAL(flag) & BIT(FMC_BIT_POS(flag)))) {
            flag_temp =  SET;
        } else {
            flag_temp =  RESET;
        }
    }
    return flag_temp;
}

/*!
    \brief      clear FMC flag status (API_ID(0x004BU))
    \param[in]  flag: FMC flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_STAT0_FLAG_PGSERR: flash stat0 program sequence error flag
      \arg        FMC_STAT0_FLAG_PGERR: flash stat0 program error flag
      \arg        FMC_STAT0_FLAG_WPERR: flash stat0 erase/program protection error flag
      \arg        FMC_STAT0_FLAG_END: flash stat0 end of operation flag
      \arg        FMC_STAT0_FLAG_CBCMDERR: flash stat0 checked area by the check blank command is all 0xFF or not flag
      \arg        FMC_STAT0_FLAG_LOADECCERR: uncorrected ECC error when load flag
      \arg        FMC_STAT0_FLAG_COMPERR: flash stat0 complement error flag
      \arg        FMC_STAT0_FLAG_RSTERR: flash stat0 POR or system reset during erase/program flag
      \arg        FMC_STAT1_FLAG_PGSERR: flash stat1 program sequence error flag
      \arg        FMC_STAT1_FLAG_PGERR: flash stat1 program error flag
      \arg        FMC_STAT1_FLAG_WPERR: flash stat1 erase/program protection error flag
      \arg        FMC_STAT1_FLAG_END: flash stat1 end of operation flag
      \arg        FMC_STAT1_FLAG_CBCMDERR: flash stat1 checked area by the check blank command is all 0xFF or not flag
      \arg        FMC_STAT1_FLAG_RSTERR: flash bank1 POR or system reset during erase/program flag
    \param[out] none
    \retval     none
*/
void fmc_flag_clear(fmc_flag_enum flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_CLEAR_FLAG(flag)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x004BU), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* clear the flags in STAT0/STAT1 register */
        FMC_REG_VAL(flag) = BIT(FMC_BIT_POS(flag));
    }
}

/*!
    \brief      enable FMC interrupt (API_ID(0x004CU))
    \param[in]  interrupt: the FMC interrupt source
                only one parameter can be selected which is shown as below:
      \arg        FMC_CTL0_INT_ERR: FMC CTL0 error interrupt
      \arg        FMC_CTL0_INT_END: FMC CTL0 end of operation interrupt
      \arg        FMC_CTL1_INT_ERR: FMC CTL1 error interrupt
      \arg        FMC_CTL1_INT_END: FMC CTL1 end of operation interrupt

    \param[out] none
    \retval     none
*/
void fmc_interrupt_enable(fmc_interrupt_enum interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_INT(interrupt)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x004CU), ERR_PARAM_INVALID);
    } else
#endif
    {
        fmc_ctl0_unlock();
        /* enable interrupt in CTL0/CTL1 register */
        FMC_REG_VAL(interrupt) |= BIT(FMC_BIT_POS(interrupt));
        fmc_ctl0_lock();
    }
}

/*!
    \brief      disable FMC interrupt (API_ID(0x004DU))
    \param[in]  interrupt: the FMC interrupt source
                only one parameter can be selected which is shown as below:
      \arg        FMC_CTL0_INT_ERR: FMC CTL0 error interrupt
      \arg        FMC_CTL0_INT_END: FMC CTL0 end of operation interrupt
      \arg        FMC_CTL1_INT_ERR: FMC CTL1 error interrupt
      \arg        FMC_CTL1_INT_END: FMC CTL1 end of operation interrupt

    \param[out] none
    \retval     none
*/
void fmc_interrupt_disable(fmc_interrupt_enum interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_INT(interrupt)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x004DU), ERR_PARAM_INVALID);
    } else
#endif
    {
        fmc_ctl0_unlock();
        /* disable interrupt in CTL0/CTL1 register */
        FMC_REG_VAL(interrupt) &= ~BIT(FMC_BIT_POS(interrupt));
        fmc_ctl0_lock();
    }
}

/*!
    \brief      get FMC interrupt flag status (API_ID(0x004EU))
    \param[in]  flag: FMC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_STAT0_INT_FLAG_PGSERR: flash stat0 program sequence error interrupt flag
      \arg        FMC_STAT0_INT_FLAG_PGERR: flash stat0 program error interrupt flag
      \arg        FMC_STAT0_INT_FLAG_WPERR: flash stat0 erase/program protection error interrupt flag
      \arg        FMC_STAT0_INT_FLAG_END: flash stat0 end of operation interrupt flag
      \arg        FMC_STAT0_INT_FLAG_CBCMDERR: flash stat0 checked area by the check blank command is all 0xFF or not interrupt flag
      \arg        FMC_STAT0_INT_FLAG_COMPERR: complement error flag in stat0 register
      \arg        FMC_STAT0_INT_FLAG_TMRERR: TMR error flag in stat0 register
      \arg        FMC_STAT0_INT_FLAG_RSTERR: flash stat0 POR or system reset during erase/program interrupt flag
      \arg        FMC_STAT1_INT_FLAG_PGSERR: flash stat1 program sequence error interrupt flag
      \arg        FMC_STAT1_INT_FLAG_PGERR: flash stat1 program error interrupt flag
      \arg        FMC_STAT1_INT_FLAG_WPERR: flash stat1 erase/program protection error interrupt flag
      \arg        FMC_STAT1_INT_FLAG_END: flash stat1 end of operation interrupt flag
      \arg        FMC_STAT1_INT_FLAG_CBCMDERR: flash stat1 checked area by the check blank command is all 0xFF or not interrupt flag
      \arg        FMC_STAT1_INT_FLAG_TMRERR: TMR error flag in stat1 register
      \arg        FMC_STAT1_INT_FLAG_RSTERR: flash stat1 POR or system reset during erase/program interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmc_interrupt_flag_get(fmc_interrupt_flag_enum int_flag)
{
    uint32_t intenable, flagstatus;
    FlagStatus flag_temp = RESET;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_INT_FLAG(int_flag)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x004EU), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* get the interrupt enable bit status */
        intenable = (FMC_REG_VAL(int_flag) & BIT(FMC_BIT_POS(int_flag)));
        /* get the corresponding flag bit status */
        flagstatus = (FMC_REG_VAL2(int_flag) & BIT(FMC_BIT_POS2(int_flag)));

        if((0U != flagstatus) && (0U != intenable)) {
            flag_temp = SET;
        } else {
            flag_temp =  RESET;
        }
    }
    return flag_temp;
}

/*!
    \brief      clear FMC interrupt flag status (API_ID(0x004FU))
    \param[in]  flag: FMC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_STAT0_INT_FLAG_PGSERR: flash stat0 program sequence error interrupt flag
      \arg        FMC_STAT0_INT_FLAG_PGERR: flash stat0 program error interrupt flag
      \arg        FMC_STAT0_INT_FLAG_WPERR: flash stat0 erase/program protection error interrupt flag
      \arg        FMC_STAT0_INT_FLAG_END: flash stat0 end of operation interrupt flag
      \arg        FMC_STAT0_INT_FLAG_CBCMDERR: flash stat0 checked area by the check blank command is all 0xFF or not interrupt flag
      \arg        FMC_STAT0_INT_FLAG_COMPERR: complement error flag in stat0 register
      \arg        FMC_STAT0_INT_FLAG_RSTERR: flash stat0 POR or system reset during erase/program interrupt flag
      \arg        FMC_STAT1_INT_FLAG_PGSERR: flash stat1 program sequence error interrupt flag
      \arg        FMC_STAT1_INT_FLAG_PGERR: flash stat1 program error interrupt flag
      \arg        FMC_STAT1_INT_FLAG_WPERR: flash stat1 erase/program protection error interrupt flag
      \arg        FMC_STAT1_INT_FLAG_END: flash stat1 end of operation interrupt flag
      \arg        FMC_STAT1_INT_FLAG_CBCMDERR: flash stat1 checked area by the check blank command is all 0xFF or not interrupt flag
      \arg        FMC_STAT1_INT_FLAG_RSTERR: flash stat1 POR or system reset during erase/program interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
void fmc_interrupt_flag_clear(fmc_interrupt_flag_enum int_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_INT_CLEAR_FLAG(int_flag)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x004FU), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* clear the interrupt flag in STAT0/STAT1 register */
        FMC_REG_VAL2(int_flag) = BIT(FMC_BIT_POS2(int_flag));
    }
}

/*!
    \brief      get FMC ECC flag status (API_ID(0x0050U))
    \param[in]  flag: FMC ecc flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_BLKFLAG_ECCCOR0: block one bit error detected and correct flag 0
      \arg        FMC_BLKFLAG_ECCCOR1: block one bit error detected and correct flag 1
      \arg        FMC_BLKFLAG_ECCCOR2: block one bit error detected and correct flag 2
      \arg        FMC_BLKFLAG_ECCCOR3: block one bit error detected and correct flag 3
      \arg        FMC_BLKFLAG_ECCAERR: block more than 4 one bit error detected
      \arg        FMC_BLKFLAG_ECCCOROV: block more than 4 one bit error detected
      \arg        FMC_BLKFLAG_ECCEDC: block EDC after ECC checker error flag
      \arg        FMC_BLKFLAG_ECCDET: block two bit errors detect flag
      \arg        FMC_BUFFLAG_ECCCOR0: buffer one bit error detected and correct flag 0
      \arg        FMC_BUFFLAG_ECCCOR1: buffer one bit error detected and correct flag 1
      \arg        FMC_BUFFLAG_ECCCOR2: buffer one bit error detected and correct flag 2
      \arg        FMC_BUFFLAG_ECCCOR3: buffer one bit error detected and correct flag 3
      \arg        FMC_BUFFLAG_ECCAERR: buffer one bit error flag at ECC address
      \arg        FMC_BUFFLAG_ECCCOROV: buffer more than 4 one bit error detected
      \arg        FMC_BUFFLAG_ECCEDC: buffer EDC after ECC checker error flag
      \arg        FMC_BUFFLAG_ECCDET: buffer two bit errors detect flag
      \arg        FMC_FPBFLAG_ECCCOR0: fast program buffer one bit error detected and correct flag 0
      \arg        FMC_FPBFLAG_ECCCOR1: fast program buffer one bit error detected and correct flag 1
      \arg        FMC_FPBFLAG_ECCCOR2: fast program buffer one bit error detected and correct flag 2
      \arg        FMC_FPBFLAG_ECCCOR3: fast program buffer one bit error detected and correct flag 3
      \arg        FMC_FPBFLAG_ECCAERR: fast program buffer ECC address one bit error flag
      \arg        FMC_FPBFLAG_ECCCOROV: fast program buffer more than 4 one bit error detected
      \arg        FMC_FPBFLAG_ECCEDC: fast program buffer EDC after ECC checker error flag
      \arg        FMC_FPBFLAG_ECCDET: fast program buffer two bit errors detect flag
    \param[in]  reg_num: register number, when ecc occurs in fast program buffer, reg_num must be FMC_REG_0
                only one parameter can be selected which is shown as below:
      \arg        FMC_REG_0: ecc occurs in block0, buffer0 or fast program buffer
      \arg        FMC_REG_1: ecc occurs in block1 or buffer1 (Only applicable to GD32A72XX / GD32A74XX when flag is FMC_BUFFLAG_xxx)
      \arg        FMC_REG_2: ecc occurs in block2 or buffer2
      \arg        FMC_REG_3: ecc occurs in block3 or buffer3
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmc_ecc_flag_get(fmc_ecc_flag_enum flag, fmc_register_enum reg_num)
{
    FlagStatus flag_temp = RESET;

