sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_ECC_FLAG(flag)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0050U), ERR_PARAM_INVALID);
    } else if(NOT_FMC_REG_NUM(reg_num)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0050U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* get FMC ecc flag */
        if(0U != (FMC_REG_VAL3(flag, reg_num) & BIT(FMC_BIT_POS(flag)))) {
            flag_temp =  SET;
        } else {
            flag_temp = RESET;
        }
    }
    return flag_temp;
}

/*!
    \brief      clear FMC ECC flag status (API_ID(0x0051U))
    \param[in]  flag: FMC ECC flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_BLKFLAG_ECCCOR0: block one bit error detected and correct flag 0
      \arg        FMC_BLKFLAG_ECCCOR1: block one bit error detected and correct flag 1
      \arg        FMC_BLKFLAG_ECCCOR2: block one bit error detected and correct flag 2
      \arg        FMC_BLKFLAG_ECCCOR3: block one bit error detected and correct flag 3
      \arg        FMC_BLKFLAG_ECCCOR3: block one bit error flag at ECC address
      \arg        FMC_BLKFLAG_ECCAERR: block more than 4 one bit error detected
      \arg        FMC_BLKFLAG_ECCEDC: block EDC after ECC checker error flag
      \arg        FMC_BLKFLAG_ECCDET: block two bit errors detect flag
      \arg        FMC_BUFFLAG_ECCCOR0: buffer one bit error detected and correct flag 0
      \arg        FMC_BUFFLAG_ECCCOR1: buffer one bit error detected and correct flag 1
      \arg        FMC_BUFFLAG_ECCCOR2: buffer one bit error detected and correct flag 2
      \arg        FMC_BUFFLAG_ECCCOR3: buffer one bit error detected and correct flag 3
      \arg        FMC_BUFFLAG_ECCAERR: buffer one bit error flag at ECC address
      \arg        FMC_BUFFLAG_ECCCOROV: buffer more than 4 one bit error detected
      \arg        FMC_BUFFLAG_ECCEDC: buffer EDC after ECC checker error flag
      \arg        FMC_BUFFLAG_ECCDET: buffer two bit errors detect flag
      \arg        FMC_FPBFLAG_ECCCOR0: fast program buffer one bit error detected and correct flag 0
      \arg        FMC_FPBFLAG_ECCCOR1: fast program buffer one bit error detected and correct flag 1
      \arg        FMC_FPBFLAG_ECCCOR2: fast program buffer one bit error detected and correct flag 2
      \arg        FMC_FPBFLAG_ECCCOR3: fast program buffer one bit error detected and correct flag 3
      \arg        FMC_FPBFLAG_ECCAERR: fast program buffer ECC address one bit error flag
      \arg        FMC_FPBFLAG_ECCCOROV: fast program buffer more than 4 one bit error detected
      \arg        FMC_FPBFLAG_ECCEDC: fast program buffer EDC after ECC checker error flag
      \arg        FMC_FPBFLAG_ECCDET: fast program buffer two bit errors detect flag
    \param[in]  reg_num: register number, when ecc occurs in fast program buffer, reg_num must be FMC_REG_0
                only one parameter can be selected which is shown as below:
      \arg        FMC_REG_0: ecc occurs in block0, buffer0 or fast program buffer
      \arg        FMC_REG_1: ecc occurs in block1 or buffer1 (Only applicable to GD32A72XX / GD32A74XX when flag is FMC_BUFFLAG_xxx)
      \arg        FMC_REG_2: ecc occurs in block2 or buffer2
      \arg        FMC_REG_3: ecc occurs in block3 or buffer3
    \param[out] none
    \retval     none
*/
void fmc_ecc_flag_clear(fmc_ecc_flag_enum flag, fmc_register_enum reg_num)
{
    uint32_t reg_temp;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_ECC_FLAG(flag)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0051U), ERR_PARAM_INVALID);
    } else if(NOT_FMC_REG_NUM(reg_num)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0051U), ERR_PARAM_INVALID);
    } else
#endif
    {
        reg_temp = FMC_REG_VAL3(flag, reg_num) & (~ECC_FLAG_CLEAR_MASK);
        if(0U != (BIT(FMC_BIT_POS(flag)) & 0xF0000U)) {
            FMC_REG_VAL3(flag, reg_num) = (reg_temp | FMC_ECCCOR_CLEAR);
        } else {
            /* clear the flags in register */
            FMC_REG_VAL3(flag, reg_num) = (reg_temp | BIT(FMC_BIT_POS(flag)));
        }
    }
}

/*!
    \brief      enable FMC ECC interrupt (API_ID(0x0052U))
    \param[in]  interrupt: the FMC interrupt source
                only one parameter can be selected which is shown as below:
      \arg        FMC_BLK_INT_ECCCOR: block one bit error correct interrupt
      \arg        FMC_BLK_INT_ECCDET: block two bits error interrupt
      \arg        FMC_BLK_INT_ECCCORV: block more than 4 one bit error detect interrupt
      \arg        FMC_BUF_INT_ECCCOR: buffer one bit error correct interrupt
      \arg        FMC_BUF_INT_ECCDET: buffer two bits error interrupt
      \arg        FMC_BUF_INT_ECCCORV: buffer more than 4 one bit error detect interrupt
      \arg        FMC_FPB_INT_ECCCOR: fast program buffer one bit error correct interrupt
      \arg        FMC_FPB_INT_ECCDET: fast program buffer two bits error interrupt
      \arg        FMC_FPB_INT_ECCCORV: fast program buffer more than 4 one bit error detect interrupt
    \param[in]  reg_num: register number, when ecc occurs in fast program buffer, reg_num must be FMC_REG_0
                only one parameter can be selected which is shown as below:
      \arg        FMC_REG_0: ecc occurs in block0, buffer0 or fast program buffer
      \arg        FMC_REG_1: ecc occurs in block1 or buffer1 (Only applicable to GD32A72XX / GD32A74XX when flag is FMC_BUF_INT_xxx)
      \arg        FMC_REG_2: ecc occurs in block2 or buffer2
      \arg        FMC_REG_3: ecc occurs in block3 or buffer3
    \param[out] none
    \retval     none
*/
void fmc_ecc_interrupt_enable(fmc_ecc_interrupt_enum interrupt, fmc_register_enum reg_num)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_ECC_INT(interrupt)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0052U), ERR_PARAM_INVALID);
    } else if(NOT_FMC_REG_NUM(reg_num)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0052U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* enable interrupt in CTL0/CTL1 register */
        FMC_REG_VAL3(interrupt, reg_num) |= BIT(FMC_BIT_POS(interrupt));
    }
}

/*!
    \brief      disable FMC ECC interrupt (API_ID(0x0053U))
    \param[in]  interrupt: the FMC interrupt source
                only one parameter can be selected which is shown as below:
      \arg        FMC_BLK_INT_ECCCOR: block one bit error correct interrupt
      \arg        FMC_BLK_INT_ECCDET: block two bits error interrupt
      \arg        FMC_BLK_INT_ECCCORV: block more than 4 one bit error detect interrupt
      \arg        FMC_BUF_INT_ECCCOR: buffer one bit error correct interrupt
      \arg        FMC_BUF_INT_ECCDET: buffer two bits error interrupt
      \arg        FMC_BUF_INT_ECCCORV: buffer more than 4 one bit error detect interrupt
      \arg        FMC_FPB_INT_ECCCOR: fast program buffer one bit error correct interrupt
      \arg        FMC_FPB_INT_ECCDET: fast program buffer two bits error interrupt
      \arg        FMC_FPB_INT_ECCCORV: fast program buffer more than 4 one bit error detect interrupt
    \param[in]  reg_num: register number, when ecc occurs in fast program buffer, reg_num must be FMC_REG_0
                only one parameter can be selected which is shown as below:
      \arg        FMC_REG_0: ecc occurs in block0, buffer0 or fast program buffer
      \arg        FMC_REG_1: ecc occurs in block1 or buffer1 (Only applicable to GD32A72XX / GD32A74XX when flag is FMC_BUF_INT_xxx)
      \arg        FMC_REG_2: ecc occurs in block2 or buffer2
      \arg        FMC_REG_3: ecc occurs in block3 or buffer3
    \param[out] none
    \retval     none
*/
void fmc_ecc_interrupt_disable(fmc_ecc_interrupt_enum interrupt, fmc_register_enum reg_num)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_ECC_INT(interrupt)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0053U), ERR_PARAM_INVALID);
    } else if(NOT_FMC_REG_NUM(reg_num)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0053U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* disable interrupt in CTL0/CTL1 register */
        FMC_REG_VAL3(interrupt, reg_num) &= ~BIT(FMC_BIT_POS(interrupt));
    }
}

/*!
    \brief      get FMC ECC interrupt flag status (API_ID(0x0054U))
    \param[in]  flag: FMC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_BLK_INT_FLAG_ECCCOR0: block one bit error detected and correct interrupt flag
      \arg        FMC_BLK_INT_FLAG_ECCCOR1: block one bit error detected and correct interrupt flag
      \arg        FMC_BLK_INT_FLAG_ECCCOR2: block one bit error detected and correct interrupt flag
      \arg        FMC_BLK_INT_FLAG_ECCCOR3: block one bit error detected and correct interrupt flag
      \arg        FMC_BLK_INT_FLAG_ECCAERR: block one bit error flag at ECC address
      \arg        FMC_BLK_INT_FLAG_ECCCOROV: block more than 4 one bit error detected interrupt flag
      \arg        FMC_BLK_INT_FLAG_ECCEDC: block EDC after ECC checker error interrupt flag
      \arg        FMC_BLK_INT_FLAG_ECCDET: block two bit errors detect flag interrupt flag
      \arg        FMC_BUF_INT_FLAG_ECCCOR0: buffer one bit error detected and correct interrupt flag
      \arg        FMC_BUF_INT_FLAG_ECCCOR1: buffer one bit error detected and correct interrupt flag
      \arg        FMC_BUF_INT_FLAG_ECCCOR2: buffer one bit error detected and correct interrupt flag
      \arg        FMC_BUF_INT_FLAG_ECCCOR3: buffer one bit error detected and correct interrupt flag
      \arg        FMC_BUF_INT_FLAG_ECCAERR: buffer one bit error flag at ECC address
      \arg        FMC_BUF_INT_FLAG_ECCCOROV: buffer more than 4 one bit error detected interrupt flag
      \arg        FMC_BUF_INT_FLAG_ECCEDC: buffer EDC after ECC checker error interrupt flag
      \arg        FMC_BUF_INT_FLAG_ECCDET: buffer two bit errors detect flag interrupt flag
      \arg        FMC_FPB_INT_FLAG_ECCCOR0: fast program buffer one bit error detected and correct interrupt flag
      \arg        FMC_FPB_INT_FLAG_ECCCOR1: fast program buffer one bit error detected and correct interrupt flag
      \arg        FMC_FPB_INT_FLAG_ECCCOR2: fast program buffer one bit error detected and correct interrupt flag
      \arg        FMC_FPB_INT_FLAG_ECCCOR3: fast program buffer one bit error detected and correct interrupt flag
      \arg        FMC_FPB_INT_FLAG_ECCAERR: fast program buffer one bit error flag at ECC address
      \arg        FMC_FPB_INT_FLAG_ECCCOROV: fast program buffer more than 4 one bit error detected interrupt flag
      \arg        FMC_FPB_INT_FLAG_ECCEDC: fast program buffer EDC after ECC checker error interrupt flag
      \arg        FMC_FPB_INT_FLAG_ECCDET: fast program buffer two bit errors detect flag interrupt flag
    \param[in]  reg_num: register number, when ecc occurs in fast program buffer, reg_num must be FMC_REG_0
                only one parameter can be selected which is shown as below:
      \arg        FMC_REG_0: ecc occurs in block0, buffer0 or fast program buffer
      \arg        FMC_REG_1: ecc occurs in block1 or buffer1 (Only applicable to GD32A72XX / GD32A74XX when flag is FMC_BUF_INT_FLAG_xxx)
      \arg        FMC_REG_2: ecc occurs in block2 or buffer2
      \arg        FMC_REG_3: ecc occurs in block3 or buffer3
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmc_ecc_interrupt_flag_get(fmc_ecc_interrupt_flag_enum int_flag, fmc_register_enum reg_num)
{
    uint32_t intenable, flagstatus;
    FlagStatus flag_temp = RESET;

