sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_ECC_INT_FLAG(int_flag)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0054U), ERR_PARAM_INVALID);
    } else if(NOT_FMC_REG_NUM(reg_num)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0054U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* get the ECC interrupt enable bit status */
        intenable = (FMC_REG_VAL3(int_flag, reg_num) & BIT(FMC_BIT_POS(int_flag)));
        /* get the corresponding flag bit status */
        flagstatus = (FMC_REG_VAL4(int_flag, reg_num) & BIT(FMC_BIT_POS2(int_flag)));

        if((0U != flagstatus) && (0u != intenable)) {
            flag_temp = SET;
        } else {
            flag_temp = RESET;
        }
    }
    return flag_temp;
}

/*!
    \brief      clear FMC ECC interrupt flag status (API_ID(0x0055U))
    \param[in]  flag: FMC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_BLK_INT_FLAG_ECCCOR0: block one bit error detected and correct interrupt flag
      \arg        FMC_BLK_INT_FLAG_ECCCOR1: block one bit error detected and correct interrupt flag
      \arg        FMC_BLK_INT_FLAG_ECCCOR2: block one bit error detected and correct interrupt flag
      \arg        FMC_BLK_INT_FLAG_ECCCOR3: block one bit error detected and correct interrupt flag
      \arg        FMC_BLK_INT_FLAG_ECCAERR: block one bit error flag at ECC address
      \arg        FMC_BLK_INT_FLAG_ECCCOROV: block more than 4 one bit error detected interrupt flag
      \arg        FMC_BLK_INT_FLAG_ECCEDC: block EDC after ECC checker error interrupt flag
      \arg        FMC_BLK_INT_FLAG_ECCDET: block two bit errors detect flag interrupt flag
      \arg        FMC_BUF_INT_FLAG_ECCCOR0: buffer one bit error detected and correct interrupt flag
      \arg        FMC_BUF_INT_FLAG_ECCCOR1: buffer one bit error detected and correct interrupt flag
      \arg        FMC_BUF_INT_FLAG_ECCCOR2: buffer one bit error detected and correct interrupt flag
      \arg        FMC_BUF_INT_FLAG_ECCCOR3: buffer one bit error detected and correct interrupt flag
      \arg        FMC_BUF_INT_FLAG_ECCAERR: buffer one bit error flag at ECC address
      \arg        FMC_BUF_INT_FLAG_ECCCOROV: buffer more than 4 one bit error detected interrupt flag
      \arg        FMC_BUF_INT_FLAG_ECCEDC: buffer EDC after ECC checker error interrupt flag
      \arg        FMC_BUF_INT_FLAG_ECCDET: buffer two bit errors detect flag interrupt flag
      \arg        FMC_FPB_INT_FLAG_ECCCOR0: fast program buffer one bit error detected and correct interrupt flag
      \arg        FMC_FPB_INT_FLAG_ECCCOR1: fast program buffer one bit error detected and correct interrupt flag
      \arg        FMC_FPB_INT_FLAG_ECCCOR2: fast program buffer one bit error detected and correct interrupt flag
      \arg        FMC_FPB_INT_FLAG_ECCCOR3: fast program buffer one bit error detected and correct interrupt flag
      \arg        FMC_FPB_INT_FLAG_ECCAERR: fast program buffer one bit error flag at ECC address
      \arg        FMC_FPB_INT_FLAG_ECCCOROV: fast program buffer more than 4 one bit error detected interrupt flag
      \arg        FMC_FPB_INT_FLAG_ECCEDC: fast program buffer EDC after ECC checker error interrupt flag
      \arg        FMC_FPB_INT_FLAG_ECCDET: fast program buffer two bit errors detect flag interrupt flag
    \param[in]  reg_num: register number, when ecc occurs in fast program buffer, reg_num must be FMC_REG_0
                only one parameter can be selected which is shown as below:
      \arg        FMC_REG_0: ecc occurs in block0, buffer0 or fast program buffer
      \arg        FMC_REG_1: ecc occurs in block1 or buffer1 (Only applicable to GD32A72XX / GD32A74XX when flag is FMC_BUF_INT_FLAG_xxx)
      \arg        FMC_REG_2: ecc occurs in block2 or buffer2
      \arg        FMC_REG_3: ecc occurs in block3 or buffer3
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
void fmc_ecc_interrupt_flag_clear(fmc_ecc_interrupt_flag_enum int_flag, fmc_register_enum reg_num)
{
    uint32_t reg_temp;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_ECC_INT_FLAG(int_flag)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0055U), ERR_PARAM_INVALID);
    } else if(NOT_FMC_REG_NUM(reg_num)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0055U), ERR_PARAM_INVALID);
    } else
#endif
    {
        reg_temp = FMC_REG_VAL4(int_flag, reg_num) & (~ECC_FLAG_CLEAR_MASK);
        if(0U != ((BIT(FMC_BIT_POS2(int_flag)) & 0xF0000U))) {
            FMC_REG_VAL4(int_flag, reg_num) = (reg_temp | FMC_ECCCOR_CLEAR);
        } else {
            /* clear the interrupt flag in ECC register */
            FMC_REG_VAL4(int_flag, reg_num) = (reg_temp | BIT(FMC_BIT_POS2(int_flag)));
        }
    }
}

/*!
    \brief      get FMC block correctable ecc error address (API_ID(0x0056U))
    \param[in]  reg_num: register number
                only one parameter can be selected which is shown as below:
      \arg        FMC_REG_0: ecc occurs in block0
      \arg        FMC_REG_1: ecc occurs in block1
      \arg        FMC_REG_2: ecc occurs in block2
      \arg        FMC_REG_3: ecc occurs in block3
    \param[in]  address_idx: the correctable ecc error address index
                only one parameter can be selected which is shown as below:
      \arg        CECC_ADDR0: FMC correctable ECC address 0
      \arg        CECC_ADDR1: FMC correctable ECC address 1
      \arg        CECC_ADDR2: FMC correctable ECC address 2
      \arg        CECC_ADDR3: FMC correctable ECC address 3
    \param[out] none
    \retval     FMC block ecc address, 0x000000 ~ 0x3FFFFF
*/
uint32_t fmc_block_cecc_address_get(fmc_register_enum reg_num, fmc_cecc_addr_enum address_idx)
{
    uint32_t reval = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_REG_NUM(reg_num)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0056U), ERR_PARAM_INVALID);
    } else if(NOT_CECC_ADDR(address_idx)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0056U), ERR_PARAM_INVALID);
    } else
#endif
    {
        reval = REG32((uint32_t)(FMC + 0x68U + 0x04U * ((uint32_t)address_idx)  + 0x100U * (uint32_t)(reg_num)));
    }
    return reval;
}

/*!
    \brief      get FMC block uncorrectable ecc error address (API_ID(0x0057U))
    \param[in]  reg_num: register number
                only one parameter can be selected which is shown as below:
      \arg        FMC_REG_0: uncorrectable ecc occurs in block0
      \arg        FMC_REG_1: uncorrectable ecc occurs in block1
      \arg        FMC_REG_2: uncorrectable ecc occurs in block2
      \arg        FMC_REG_3: uncorrectable ecc occurs in block3
    \param[out] none
    \retval     FMC block ecc address, 0x000000 ~ 0x3FFFFF
*/
uint32_t fmc_block_ucecc_address_get(fmc_register_enum reg_num)
{
    uint32_t reval = 0U;

