sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_REG_NUM(reg_num)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0057U), ERR_PARAM_INVALID);
    } else
#endif
    {
        reval = (uint32_t)FMC_BLKUCECCADDR(reg_num);
    }
    return reval;
}

/*!
    \brief      get FMC buffer correctable ecc error address (API_ID(0x0058U))
    \param[in]  reg_num: register number
                only one parameter can be selected which is shown as below:
      \arg        FMC_REG_0: ecc occurs in buffer0
      \arg        FMC_REG_1: ecc occurs in buffer1 (Only applicable to GD32A72XX / GD32A74XX)
      \arg        FMC_REG_2: ecc occurs in buffer2
      \arg        FMC_REG_3: ecc occurs in buffer3
    \param[in]  address_idx: the correctable ecc error address index
                only one parameter can be selected which is shown as below:
      \arg        CECC_ADDR0: FMC correctable ECC address 0
      \arg        CECC_ADDR1: FMC correctable ECC address 1
      \arg        CECC_ADDR2: FMC correctable ECC address 2
      \arg        CECC_ADDR3: FMC correctable ECC address 3
    \param[out] none
    \retval     FMC block ecc address, 0x000000 ~ 0xFFFFFF
*/
uint32_t fmc_buffer_cecc_address_get(fmc_register_enum reg_num, fmc_cecc_addr_enum address_idx)
{
    uint32_t reval = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_REG_NUM(reg_num)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0058U), ERR_PARAM_INVALID);
    } else if(NOT_CECC_ADDR(address_idx)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0058U), ERR_PARAM_INVALID);
    } else
#endif
    {
        reval =  REG32((uint32_t)(FMC + 0x88U + 0x04U * (uint32_t)(address_idx)  + 0x100U * (uint32_t)(reg_num)));
    }
    return reval;
}

/*!
    \brief      get FMC buffer uncorrectable ecc error address (API_ID(0x0059U))
    \param[in]  reg_num: register number
                only one parameter can be selected which is shown as below:
      \arg        FMC_REG_0: uncorrectable ecc occurs in buffer0
      \arg        FMC_REG_1: uncorrectable ecc occurs in buffer1 (Only applicable to GD32A72XX / GD32A74XX)
      \arg        FMC_REG_2: uncorrectable ecc occurs in buffer2
      \arg        FMC_REG_3: uncorrectable ecc occurs in buffer3
    \param[out] none
    \retval     FMC block ecc address, 0x000000 ~ 0xFFFFFF
*/
uint32_t fmc_buffer_ucecc_address_get(fmc_register_enum reg_num)
{
    uint32_t reval = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_REG_NUM(reg_num)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0059U), ERR_PARAM_INVALID);
    } else
#endif
    {
        reval = (uint32_t)FMC_BUFUCECCADDR(reg_num);
    }
    return reval;
}


/*!
    \brief      get FMC fast program buffer correctable ecc error address (API_ID(0x005AU))
    \param[in]  address_idx: the correctable ecc error address index
                only one parameter can be selected which is shown as below:
      \arg        CECC_ADDR0: FMC correctable ECC address 0
      \arg        CECC_ADDR1: FMC correctable ECC address 1
      \arg        CECC_ADDR2: FMC correctable ECC address 2
      \arg        CECC_ADDR3: FMC correctable ECC address 3
    \param[out] none
    \retval     FMC block ecc address, 0x000 ~ 0x3FF
*/
uint32_t fmc_fpb_cecc_address_get(fmc_cecc_addr_enum address_idx)
{
    uint32_t reval = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CECC_ADDR(address_idx)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x005AU), ERR_PARAM_INVALID);
    } else
#endif
    {
        reval = REG32((uint32_t)((FMC) + 0x000000A8U + 0x04U * (uint32_t)(address_idx)));
    }
    return reval;
}

/*!
    \brief      get FMC fast program buffer uncorrectable ecc error address (API_ID(0x005BU))
    \param[in]  none
    \param[out] none
    \retval     FMC block ecc address, 0x000 ~ 0x3FF
*/
uint32_t fmc_fpb_ucecc_address_get(void)
{
    return (uint32_t)FMC_FPB_UCECCADDR;
}

/*!
    \brief      get PID (API_ID(0x005CU))
    \param[in]  pidx: pid index
                only one parameter can be selected which is shown as below:
      \arg        FMC_PID_0: PID0 index
      \arg        FMC_PID_1: PID1 index
    \param[out] none
    \retval     FMC block ecc address, 0x00000000 ~ 0xFFFFFFFF
*/
uint32_t fmc_pid_get(uint32_t pidx)
{
    uint32_t reval = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_PID_INDEX(pidx)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x005CU), ERR_PARAM_INVALID);
    } else
#endif
    {
        reval = REG32((FMC) + 0x000000D0U + 0x04U * pidx);
    }
    return reval;
}

/*!
    \brief      return the FMC ctl0 state
    \param[in]  none
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_LOADECCERR: uncorrected ECC error when load
      \arg        FMC_COMPERR: complement error in writing data
      \arg        FMC_TMERR: TMR error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
static fmc_state_enum fmc_ctl0_state_get(void)
{
    fmc_state_enum fmc_state = FMC_READY;

    if((uint32_t)0x00U != (FMC_STAT0 & FMC_STAT0_BUSY)) {
        fmc_state = FMC_BUSY;
    } else {
        if((uint32_t)0x00U != (FMC_STAT0 & FMC_STAT0_WPERR)) {
            fmc_state = FMC_WPERR;
        } else if((uint32_t)0x00U != (FMC_STAT0 & FMC_STAT0_PGERR)) {
            fmc_state = FMC_PGERR;
        } else if((uint32_t)0x00U != (FMC_STAT0 & FMC_STAT0_PGSERR)) {
            fmc_state = FMC_PGSERR;
        } else if((uint32_t)0x00U != (FMC_STAT0 & FMC_STAT0_CBCMDERR)) {
            fmc_state = FMC_CBCMDERR;
        } else if((uint32_t)0x00U != (FMC_STAT0 & FMC_STAT0_LOADECCERR)) {
            fmc_state = FMC_LOADECCERR;
        } else if((uint32_t)0x00U != (FMC_STAT0 & FMC_STAT0_COMPERR)) {
            fmc_state = FMC_COMPERR;
        } else if((uint32_t)0x00U != (FMC_STAT0 & FMC_STAT0_TMRERR)) {
            fmc_state = FMC_TMRERR;
        } else if((uint32_t)0x00U != (FMC_STAT0 & FMC_STAT0_RSTERR)) {
            fmc_state = FMC_RSTERR;
        } else {
            /* illegal parameters */
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      return the FMC ctl1 state
    \param[in]  none
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_TMERR: TMR error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
static fmc_state_enum fmc_ctl1_state_get(void)
{
    fmc_state_enum fmc_state = FMC_READY;

    if((uint32_t)0x00U != (FMC_STAT1 & FMC_STAT1_BUSY)) {
        fmc_state = FMC_BUSY;
    } else {
        if((uint32_t)0x00U != (FMC_STAT1 & FMC_STAT1_WPERR)) {
            fmc_state = FMC_WPERR;
        } else if((uint32_t)0x00U != (FMC_STAT1 & FMC_STAT1_PGERR)) {
            fmc_state = FMC_PGERR;
        } else if((uint32_t)0x00U != (FMC_STAT1 & FMC_STAT1_PGSERR)) {
            fmc_state = FMC_PGSERR;
        } else if((uint32_t)0x00U != (FMC_STAT1 & FMC_STAT1_CBCMDERR)) {
            fmc_state = FMC_CBCMDERR;
        } else if((uint32_t)0x00U != (FMC_STAT1 & FMC_STAT1_TMRERR)) {
            fmc_state = FMC_TMRERR;
        } else if((uint32_t)0x00U != (FMC_STAT1 & FMC_STAT1_RSTERR)) {
            fmc_state = FMC_RSTERR;
        } else {
            /* This code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      check whether FMC ctl0 is ready or not
    \param[in]  timeout: timeout count
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_LOADECCERR: uncorrected ECC error when load
      \arg        FMC_COMPERR: complement error in writing data
      \arg        FMC_TMERR: TMR error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
static fmc_state_enum fmc_ctl0_ready_wait(uint32_t timeout)
{
    fmc_state_enum fmc_state;

    /* wait for FMC ready */
    do {
        /* get FMC state */
        fmc_state = fmc_ctl0_state_get();
        timeout--;
    } while((FMC_BUSY == fmc_state) && (0U != timeout));

    if(FMC_BUSY == fmc_state) {
        fmc_state = FMC_TOERR;
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      check whether FMC ctl1 is ready or not
    \param[in]  timeout: timeout count
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
      \arg        FMC_TMERR: TMR error
      \arg        FMC_RSTERR: POR or system reset during flash erase/program error
*/
static fmc_state_enum fmc_ctl1_ready_wait(uint32_t timeout)
{
    fmc_state_enum fmc_state;

    /* wait for FMC ready */
    do {
        /* get FMC state */
        fmc_state = fmc_ctl1_state_get();
        timeout--;
    } while((FMC_BUSY == fmc_state) && (0U != timeout));

    if(FMC_BUSY == fmc_state) {
        fmc_state = FMC_TOERR;
    }

    /* return the FMC state */
    return fmc_state;
}
